[
  {
    "term": "abstract data type",
    "explanations": [
      "A mathematical model for data types in which a data type is defined by its behavior (semantics) from the point of view of a user of the data, specifically in terms of possible values, possible operations on data of this type, and the behavior of these operations. This contrasts with data structures, which are concrete representations of data from the point of view of an implementer rather than a user."
    ]
  },
  {
    "term": "abstract method",
    "explanations": [
      "One with only a signature and no implementation body. It is often used to specify that a subclass must provide an implementation of the method. Abstract methods are used to specify interfaces in some computer languages."
    ]
  },
  {
    "term": "abstraction",
    "explanations": [
      "1. In software engineering and computer science, the process of removing physical, spatial, or temporal details or attributes in the study of objects or systems in order to more closely attend to other details of interest; it is also very similar in nature to the process of generalization.",
      "2. The result of this process: an abstract concept-object created by keeping common features or attributes to various concrete objects or systems of study."
    ]
  },
  {
    "term": "agent architecture",
    "explanations": [
      "A blueprint for software agents and intelligent control systems depicting the arrangement of components. The architectures implemented by intelligent agents are referred to as cognitive architectures."
    ]
  },
  {
    "term": "agent-based model",
    "explanations": [
      "A class of computational models for simulating the actions and interactions of autonomous agents (both individual or collective entities such as organizations or groups) with a view to assessing their effects on the system as a whole. It combines elements of game theory, complex systems, emergence, computational sociology, multi-agent systems, and evolutionary programming. Monte Carlo methods are used to introduce randomness."
    ]
  },
  {
    "term": "aggregate function",
    "explanations": [
      "In database management, a function in which the values of multiple rows are grouped together to form a single value of more significant meaning or measurement, such as a sum, count, or max."
    ]
  },
  {
    "term": "agile software development",
    "explanations": [
      "An approach to software development under which requirements and solutions evolve through the collaborative effort of self-organizing and cross-functional teams and their customer(s)/end user(s). It advocates adaptive planning, evolutionary development, early delivery, and continual improvement, and it encourages rapid and flexible response to change."
    ]
  },
  {
    "term": "algorithm",
    "explanations": [
      "An unambiguous specification of how to solve a class of problems. Algorithms can perform calculation, data processing, and automated reasoning tasks. They are ubiquitous in computing technologies."
    ]
  },
  {
    "term": "algorithm design",
    "explanations": [
      "A method or mathematical process for problem-solving and for engineering algorithms. The design of algorithms is part of many solution theories of operation research, such as dynamic programming and divide-and-conquer. Techniques for designing and implementing algorithm designs are also called algorithm design patterns, such as the template method pattern and decorator pattern."
    ]
  },
  {
    "term": "algorithmic efficiency",
    "explanations": [
      "A property of an algorithm which relates to the number of computational resources used by the algorithm. An algorithm must be analyzed to determine its resource usage, and the efficiency of an algorithm can be measured based on usage of different resources. Algorithmic efficiency can be thought of as analogous to engineering productivity for a repeating or continuous process."
    ]
  },
  {
    "term": "American Standard Code for Information Interchange",
    "explanations": [
      "A character encoding standard for electronic communications. ASCII codes represent text in computers, telecommunications equipment, and other devices. Most modern character-encoding schemes are based on ASCII, although they support many additional characters."
    ]
  },
  {
    "term": "application programming interface",
    "explanations": [
      "A set of subroutine definitions, communication protocols, and tools for building software. In general terms, it is a set of clearly defined methods of communication among various components. A good API makes it easier to develop a computer program by providing all the building blocks, which are then put together by the programmer."
    ]
  },
  {
    "term": "application software",
    "explanations": []
  },
  {
    "term": "array data structure",
    "explanations": []
  },
  {
    "term": "artifact",
    "explanations": [
      "One of many kinds of tangible by-products produced during the development of software. Some artifacts (e.g. use cases, class diagrams, and other Unified Modeling Language (UML) models, requirements, and design documents) help describe the function, architecture, and design of software. Other artifacts are concerned with the process of development itself such as project plans, business cases, and risk assessments."
    ]
  },
  {
    "term": "artificial intelligence",
    "explanations": []
  },
  {
    "term": "ASCII",
    "explanations": ["See American Standard Code for Information Interchange."]
  },
  {
    "term": "assertion",
    "explanations": [
      "In computer programming, a statement that a predicate (Boolean-valued function, i.e. a true false expression) is always true at that point in code execution. It can help a programmer read the code, help a compiler compile it, or help the program detect its own defects. For the latter, some programs check assertions by actually evaluating the predicate as they run and if it is not in fact true  an assertion failure  the program considers itself to be broken and typically deliberately crashes or throws an assertion failure exception."
    ]
  },
  {
    "term": "associative array",
    "explanations": [
      "An associative array, map, symbol table, or dictionary is an abstract data type composed of a collection of (key, value) pairs, such that each possible key appears at most once in the collection. Operations associated with this data type allow: the addition of a pair to the collection the removal of a pair from the collection the modification of an existing pair the lookup of a value associated with a particular key"
    ]
  },
  {
    "term": "automata theory",
    "explanations": [
      "The study of abstract machines and automata, as well as the computational problems that can be solved using them. It is a theory in theoretical computer science and discrete mathematics (a subject of study in both mathematics and computer science)."
    ]
  },
  {
    "term": "automated reasoning",
    "explanations": [
      "An area of computer science and mathematical logic dedicated to understanding different aspects of reasoning. The study of automated reasoning helps produce computer programs that allow computers to reason completely, or nearly completely, automatically. Although automated reasoning is considered a sub-field of artificial intelligence, it also has connections with theoretical computer science, and even philosophy."
    ]
  },
  {
    "term": "bandwidth",
    "explanations": [
      "The maximum rate of data transfer across a given path. Bandwidth may be characterized as network bandwidth, data bandwidth, or digital bandwidth."
    ]
  },
  {
    "term": "Bayesian programming",
    "explanations": [
      "A formalism and a methodology for having a technique to specify probabilistic models and solve problems when less than the necessary information is available."
    ]
  },
  {
    "term": "benchmark",
    "explanations": [
      "The act of running a computer program, a set of programs, or other operations, in order to assess the relative performance of an object, normally by running a number of standard tests and trials against it. The term benchmark is also commonly utilized for the purposes of elaborately designed benchmarking programs themselves."
    ]
  },
  {
    "term": "best, worst and average case",
    "explanations": [
      "Expressions of what the resource usage is at least, at most, and on average, respectively, for a given algorithm. Usually the resource being considered is running time, i.e. time complexity, but it could also be memory or some other resource. Best case is the function which performs the minimum number of steps on input data of n elements; worst case is the function which performs the maximum number of steps on input data of size n; average case is the function which performs an average number of steps on input data of n elements."
    ]
  },
  {
    "term": "big data",
    "explanations": [
      "A term used to refer to data sets that are too large or complex for traditional data-processing application software to adequately deal with. Data with many cases (rows) offer greater statistical power, while data with higher complexity (more attributes or columns) may lead to a higher false discovery rate."
    ]
  },
  {
    "term": "big O notation",
    "explanations": [
      "A mathematical notation that describes the limiting behavior of a function when the argument tends towards a particular value or infinity. It is a member of a family of notations invented by Paul Bachmann, Edmund Landau, and others, collectively called Bachmann Landau notation or asymptotic notation."
    ]
  },
  {
    "term": "binary number",
    "explanations": [
      "In mathematics and digital electronics, a number expressed in the base-2 numeral system or binary numeral system, which uses only two symbols: typically 0 (zero) and 1 (one)."
    ]
  },
  {
    "term": "binary search algorithm",
    "explanations": []
  },
  {
    "term": "binary tree",
    "explanations": [
      "A tree data structure in which each node has at most two children, which are referred to as the left child and the right child. A recursive definition using just set theory notions is that a (non-empty) binary tree is a tuple (L, S, R), where L and R are binary trees or the empty set and S is a singleton set. Some authors allow the binary tree to be the empty set as well."
    ]
  },
  {
    "term": "bioinformatics",
    "explanations": [
      "An interdisciplinary field that combines biology, computer science, information engineering, mathematics, and statistics to develop methods and software tools for analyzing and interpreting biological data. Bioinformatics is widely used for in silico analyses of biological queries using mathematical and statistical techniques."
    ]
  },
  {
    "term": "bit",
    "explanations": [
      "A basic unit of information used in computing and digital communications; a portmanteau of binary digit. A binary digit can have one of two possible values, and may be physically represented with a two-state device. These state values are most commonly represented as either a 0or1."
    ]
  },
  {
    "term": "bit rate",
    "explanations": []
  },
  {
    "term": "blacklist",
    "explanations": []
  },
  {
    "term": "BMP file format",
    "explanations": []
  },
  {
    "term": "Boolean data type",
    "explanations": [
      "A data type that has one of two possible values (usually denoted true and false), intended to represent the two truth values of logic and Boolean algebra. It is named after George Boole, who first defined an algebraic system of logic in the mid-19th century. The Boolean data type is primarily associated with conditional statements, which allow different actions by changing control flow depending on whether a programmer-specified Boolean condition evaluates to true or false. It is a special case of a more general logical data type (see probabilistic logic) i.e. logic need not always be Boolean."
    ]
  },
  {
    "term": "Boolean expression",
    "explanations": [
      "An expression used in a programming language that returns a Boolean value when evaluated, that is one of true or false. A Boolean expression may be composed of a combination of the Boolean constants true or false, Boolean-typed variables, Boolean-valued operators, and Boolean-valued functions."
    ]
  },
  {
    "term": "Boolean algebra",
    "explanations": [
      "In mathematics and mathematical logic, the branch of algebra in which the values of the variables are the truth values true and false, usually denoted 1 and 0, respectively. Contrary to elementary algebra, where the values of the variables are numbers and the prime operations are addition and multiplication, the main operations of Boolean algebra are the conjunction and, the disjunction, and the negation not. It is thus a formalism for describing logical relations in the same way that elementary algebra describes numeric relations."
    ]
  },
  {
    "term": "byte",
    "explanations": [
      "A unit of digital information that most commonly consists of eight bits, representing a binary number. Historically, the byte was the number of bits used to encode a single character of text in a computer and for this reason it is the smallest addressable unit of memory in many computer architectures."
    ]
  },
  {
    "term": "booting",
    "explanations": [
      "The procedures implemented in starting up a computer or computer appliance until it can be used. It can be initiated by hardware such as a button press or by a software command. After the power is switched on, the computer is relatively dumb and can read only part of its storage called read-only memory. There, a small program is stored called firmware. It does power-on self-tests and, most importantly, allows access to other types of memory like a hard disk and main memory. The firmware loads bigger programs into the computer's main memory and runs it."
    ]
  },
  {
    "term": "callback",
    "explanations": []
  },
  {
    "term": "central processing unit",
    "explanations": [
      "The electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logic, controlling, and input/output (I/O) operations specified by the instructions. The computer industry has used the term \"central processing unit\" at least since the early 1960s. Traditionally, the term \"CPU\" refers to a processor, more specifically to its processing unit and control unit (CU), distinguishing these core elements of a computer from external components such as main memory and I/O circuitry."
    ]
  },
  {
    "term": "character",
    "explanations": [
      "A unit of information that roughly corresponds to a grapheme, grapheme-like unit, or symbol, such as in an alphabet or syllabary in the written form of a natural language."
    ]
  },
  {
    "term": "cipher",
    "explanations": []
  },
  {
    "term": "class",
    "explanations": [
      "In object-oriented programming, an extensible program-code-template for creating objects, providing initial values for state (member variables) and implementations of behavior (member functions or methods). In many languages, the class name is used as the name for the class (the template itself), the name for the default constructor of the class (a subroutine that creates objects), and as the type of objects generated by instantiating the class; these distinct concepts are easily conflated."
    ]
  },
  {
    "term": "class-based programming",
    "explanations": []
  },
  {
    "term": "client",
    "explanations": [
      "A piece of computer hardware or software that accesses a service made available by a server. The server is often (but not always) on another computer system, in which case the client accesses the service by way of a network. The term applies to the role that programs or devices play in the client server model."
    ]
  },
  {
    "term": "cleanroom software engineering",
    "explanations": [
      "A software development process intended to produce software with a certifiable level of reliability. The cleanroom process was originally developed by Harlan Mills and several of his colleagues including Alan Hevner at IBM. The focus of the cleanroom process is on defect prevention, rather than defect removal."
    ]
  },
  {
    "term": "closure",
    "explanations": []
  },
  {
    "term": "cloud computing",
    "explanations": [
      "Shared pools of configurable computer system resources and higher-level services that can be rapidly provisioned with minimal management effort, often over the Internet. Cloud computing relies on sharing of resources to achieve coherence and economies of scale, similar to a public utility."
    ]
  },
  {
    "term": "code library",
    "explanations": [
      "A collection of non-volatile resources used by computer programs, often for software development. These may include configuration data, documentation, help data, message templates, pre-written code and subroutines, classes, values or type specifications. In IBM's OS/360 and its successors they are referred to as partitioned data sets."
    ]
  },
  {
    "term": "coding",
    "explanations": [
      "Computer programming is the process of designing and building an executable computer program for accomplishing a specific computing task. Programming involves tasks such as analysis, generating algorithms, profiling algorithms' accuracy and resource consumption, and the implementation of algorithms in a chosen programming language (commonly referred to as coding). The source code of a program is written in one or more programming languages. The purpose of programming is to find a sequence of instructions that will automate the performance of a task for solving a given problem. The process of programming thus often requires expertise in several different subjects, including knowledge of the application domain, specialized algorithms, and formal logic."
    ]
  },
  {
    "term": "coding theory",
    "explanations": [
      "The study of the properties of codes and their respective fitness for specific applications. Codes are used for data compression, cryptography, error detection and correction, data transmission and data storage. Codes are studied by various scientific disciplines such as information theory, electrical engineering, mathematics, linguistics, and computer science for the purpose of designing efficient and reliable data transmission methods. This typically involves the removal of redundancy and the correction or detection of errors in the transmitted data."
    ]
  },
  {
    "term": "cognitive science",
    "explanations": [
      "The interdisciplinary, scientific study of the mind and its processes. It examines the nature, the tasks, and the functions of cognition (in a broad sense). Cognitive scientists study intelligence and behavior, with a focus on how nervous systems represent, process, and transform information. Mental faculties of concern to cognitive scientists include language, perception, memory, attention, reasoning, and emotion; to understand these faculties, cognitive scientists borrow from fields such as linguistics, psychology, artificial intelligence, philosophy, neuroscience, and anthropology."
    ]
  },
  {
    "term": "collection",
    "explanations": [
      "A collection or container is a grouping of some variable number of data items (possibly zero) that have some shared significance to the problem being solved and need to be operated upon together in some controlled fashion. Generally, the data items will be of the same type or, in languages supporting inheritance, derived from some common ancestor type. A collection is a concept applicable to abstract data types, and does not prescribe a specific implementation as a concrete data structure, though often there is a conventional choice (see Container for type theory discussion)."
    ]
  },
  {
    "term": "comma-separated values",
    "explanations": [
      "A delimited text file that uses a comma to separate values. A CSV file stores tabular data (numbers and text) in plain text. Each line of the file is a data record. Each record consists of one or more fields, separated by commas. The use of the comma as a field separator is the source of the name for this file format."
    ]
  },
  {
    "term": "compiler",
    "explanations": [
      "A computer program that transforms computer code written in one programming language (the source language) into another programming language (the target language). Compilers are a type of translator that support digital devices, primarily computers. The name compiler is primarily used for programs that translate source code from a high-level programming language to a lower-level language (e.g. assembly language, object code, or machine code) to create an executable program."
    ]
  },
  {
    "term": "computability theory",
    "explanations": [
      "also known as recursion theory, is a branch of mathematical logic, of computer science, and of the theory of computation that originated in the 1930s with the study of computable functions and Turing degrees. The field has since expanded to include the study of generalized computability and definability. In these areas, recursion theory overlaps with proof theory and effective descriptive set theory."
    ]
  },
  {
    "term": "computation",
    "explanations": [
      "Any type of calculation that includes both arithmetical and non-arithmetical steps and follows a well-defined model, e.g. an algorithm. The study of computation is paramount to the discipline of computer science."
    ]
  },
  {
    "term": "computational biology",
    "explanations": [
      "Involves the development and application of data-analytical and theoretical methods, mathematical modelling and computational simulation techniques to the study of biological, ecological, behavioural, and social systems. The field is broadly defined and includes foundations in biology, applied mathematics, statistics, biochemistry, chemistry, biophysics, molecular biology, genetics, genomics, computer science, and evolution. Computational biology is different from biological computing, which is a subfield of computer science and computer engineering using bioengineering and biology to build computers."
    ]
  },
  {
    "term": "computational chemistry",
    "explanations": [
      "A branch of chemistry that uses computer simulation to assist in solving chemical problems. It uses methods of theoretical chemistry, incorporated into efficient computer programs, to calculate the structures and properties of molecules and solids."
    ]
  },
  {
    "term": "computational complexity theory",
    "explanations": [
      "A subfield of computational science which focuses on classifying computational problems according to their inherent difficulty, and relating these classes to each other. A computational problem is a task solved by a computer. A computation problem is solvable by mechanical application of mathematical steps, such as an algorithm."
    ]
  },
  {
    "term": "computational model",
    "explanations": [
      "A mathematical model in computational science that requires extensive computational resources to study the behavior of a complex system by computer simulation."
    ]
  },
  {
    "term": "computational neuroscience",
    "explanations": []
  },
  {
    "term": "computational physics",
    "explanations": [
      "Is the study and implementation of numerical analysis to solve problems in physics for which a quantitative theory already exists. Historically, computational physics was the first application of modern computers in science, and is now a subset of computational science."
    ]
  },
  {
    "term": "computational science",
    "explanations": []
  },
  {
    "term": "computational steering",
    "explanations": [
      "Is the practice of manually intervening with an otherwise autonomous computational process, to change its outcome."
    ]
  },
  {
    "term": "computer",
    "explanations": [
      "A device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming. Modern computers have the ability to follow generalized sets of operations, called programs. These programs enable computers to perform an extremely wide range of tasks."
    ]
  },
  {
    "term": "computer architecture",
    "explanations": [
      "A set of rules and methods that describe the functionality, organization, and implementation of computer systems. Some definitions of architecture define it as describing the capabilities and programming model of a computer but not a particular implementation. In other definitions computer architecture involves instruction set architecture design, microarchitecture design, logic design, and implementation."
    ]
  },
  {
    "term": "computer data storage",
    "explanations": []
  },
  {
    "term": "computer ethics",
    "explanations": [
      "A part of practical philosophy concerned with how computing professionals should make decisions regarding professional and social conduct."
    ]
  },
  {
    "term": "computer graphics",
    "explanations": [
      "Pictures and films created using computers. Usually, the term refers to computer-generated image data created with the help of specialized graphical hardware and software. It is a vast and recently developed area of computer science."
    ]
  },
  {
    "term": "computer network",
    "explanations": []
  },
  {
    "term": "computer program",
    "explanations": [
      "Is a collection of instructions that can be executed by a computer to perform a specific task."
    ]
  },
  {
    "term": "computer programming",
    "explanations": [
      "The process of designing and building an executable computer program for accomplishing a specific computing task. Programming involves tasks such as analysis, generating algorithms, profiling algorithms' accuracy and resource consumption, and the implementation of algorithms in a chosen programming language (commonly referred to as coding). The source code of a program is written in one or more programming languages. The purpose of programming is to find a sequence of instructions that will automate the performance of a task for solving a given problem. The process of programming thus often requires expertise in several different subjects, including knowledge of the application domain, specialized algorithms, and formal logic."
    ]
  },
  {
    "term": "computer science",
    "explanations": [
      "The theory, experimentation, and engineering that form the basis for the design and use of computers. It involves the study of algorithms that process, store, and communicate digital information. A computer scientist specializes in the theory of computation and the design of computational systems."
    ]
  },
  {
    "term": "computer scientist",
    "explanations": [
      "A person who has acquired the knowledge of computer science, the study of the theoretical foundations of information and computation and their application."
    ]
  },
  {
    "term": "computer security",
    "explanations": []
  },
  {
    "term": "computer vision",
    "explanations": [
      "An interdisciplinary scientific field that deals with how computers can be made to gain high-level understanding from digital images or videos. From the perspective of engineering, it seeks to automate tasks that the human visual system can do."
    ]
  },
  {
    "term": "computing",
    "explanations": [
      "Is any goal-oriented activity requiring, benefiting from, or creating computing machinery. It includes study of algorithmic processes and development of both hardware and software. It has scientific, engineering, mathematical, technological and social aspects. Major computing fields include computer engineering, computer science, cybersecurity, data science, information systems, information technology and software engineering."
    ]
  },
  {
    "term": "concatenation",
    "explanations": [
      "In formal language theory and computer programming, string concatenation is the operation of joining character strings end-to-end. For example, the concatenation of \"snow\" and \"ball\" is \"snowball\". In certain formalisations of concatenation theory, also called string theory, string concatenation is a primitive notion."
    ]
  },
  {
    "term": "Concurrency",
    "explanations": [
      "The ability of different parts or units of a program, algorithm, or problem to be executed out-of-order or in partial order, without affecting the final outcome. This allows for parallel execution of the concurrent units, which can significantly improve overall speed of the execution in multi-processor and multi-core systems. In more technical terms, concurrency refers to the decomposability property of a program, algorithm, or problem into order-independent or partially-ordered components or units."
    ]
  },
  {
    "term": "conditional",
    "explanations": []
  },
  {
    "term": "container",
    "explanations": [
      "Is a class, a data structure, or an abstract data type (ADT) whose instances are collections of other objects. In other words, they store objects in an organized way that follows specific access rules. The size of the container depends on the number of objects (elements) it contains. Underlying (inherited) implementations of various container types may vary in size and complexity, and provide flexibility in choosing the right implementation for any given scenario."
    ]
  },
  {
    "term": "continuation-passing style",
    "explanations": []
  },
  {
    "term": "control flow",
    "explanations": []
  },
  {
    "term": "Creative Commons",
    "explanations": []
  },
  {
    "term": "cryptography",
    "explanations": [
      "Or cryptology, is the practice and study of techniques for secure communication in the presence of third parties called adversaries. More generally, cryptography is about constructing and analyzing protocols that prevent third parties or the public from reading private messages; various aspects in information security such as data confidentiality, data integrity, authentication, and non-repudiation are central to modern cryptography. Modern cryptography exists at the intersection of the disciplines of mathematics, computer science, electrical engineering, communication science, and physics. Applications of cryptography include electronic commerce, chip-based payment cards, digital currencies, computer passwords, and military communications."
    ]
  },
  {
    "term": "CSV",
    "explanations": ["See comma-separated values."]
  },
  {
    "term": "cyberbullying",
    "explanations": []
  },
  {
    "term": "cyberspace",
    "explanations": ["Widespread, interconnected digital technology."]
  },
  {
    "term": "daemon",
    "explanations": [
      "In multitasking computer operating systems, a daemon is a computer program that runs as a background process, rather than being under the direct control of an interactive user. Traditionally, the process names of a daemon end with the letter d, for clarification that the process is in fact a daemon, and for differentiation between a daemon and a normal computer program. For example, syslogd is a daemon that implements system logging facility, and sshd is a daemon that serves incoming SSH connections."
    ]
  },
  {
    "term": "Data",
    "explanations": []
  },
  {
    "term": "data center",
    "explanations": []
  },
  {
    "term": "database",
    "explanations": [
      "An organized collection of data, generally stored and accessed electronically from a computer system. Where databases are more complex, they are often developed using formal design and modeling techniques."
    ]
  },
  {
    "term": "data mining",
    "explanations": [
      "Is a process of discovering patterns in large data sets involving methods at the intersection of machine learning, statistics, and database systems. Data mining is an interdisciplinary subfield of computer science and statistics with an overall goal to extract information (with intelligent methods) from a data set and transform the information into a comprehensible structure for further use. Data mining is the analysis step of the \"knowledge discovery in databases\" process, or KDD. Aside from the raw analysis step, it also involves database and data management aspects, data pre-processing, model and inference considerations, interestingness metrics, complexity considerations, post-processing of discovered structures, visualization, and online updating."
    ]
  },
  {
    "term": "data science",
    "explanations": [
      "An interdisciplinary field that uses scientific methods, processes, algorithms, and systems to extract knowledge and insights from data in various forms, both structured and unstructured, similar to data mining. Data science is a \"concept to unify statistics, data analysis, machine learning and their related methods\" in order to \"understand and analyze actual phenomena\" with data. It employs techniques and theories drawn from many fields within the context of mathematics, statistics, information science, and computer science."
    ]
  },
  {
    "term": "data structure",
    "explanations": [
      "A data organization, management, and storage format that enables efficient access and modification. More precisely, a data structure is a collection of data values, the relationships among them, and the functions or operations that can be applied to the data."
    ]
  },
  {
    "term": "data type",
    "explanations": []
  },
  {
    "term": "debugging",
    "explanations": [
      "The process of finding and resolving defects or problems within a computer program that prevent correct operation of computer software or the system as a whole. Debugging tactics can involve interactive debugging, control flow analysis, unit testing, integration testing, log file analysis, monitoring at the application or system level, memory dumps, and profiling."
    ]
  },
  {
    "term": "declaration",
    "explanations": [
      "In computer programming, a language construct that specifies properties of an identifier: it declares what a word (identifier) \"means\". Declarations are most commonly used for functions, variables, constants, and classes, but can also be used for other entities such as enumerations and type definitions. Beyond the name (the identifier itself) and the kind of entity (function, variable, etc.), declarations typically specify the data type (for variables and constants), or the type signature (for functions); types may also include dimensions, such as for arrays. A declaration is used to announce the existence of the entity to the compiler; this is important in those strongly typed languages that require functions, variables, and constants, and their types, to be specified with a declaration before use, and is used in forward declaration. The term \"declaration\" is frequently contrasted with the term \"definition\", but meaning and usage varies significantly between languages."
    ]
  },
  {
    "term": "digital data",
    "explanations": [
      "In information theory and information systems, the discrete, discontinuous representation of information or works. Numbers and letters are commonly used representations."
    ]
  },
  {
    "term": "digital signal processing",
    "explanations": []
  },
  {
    "term": "discrete event simulation",
    "explanations": []
  },
  {
    "term": "disk storage",
    "explanations": [
      "(Also sometimes called drive storage) is a general category of storage mechanisms where data is recorded by various electronic, magnetic, optical, or mechanical changes to a surface layer of one or more rotating disks. A disk drive is a device implementing such a storage mechanism. Notable types are the hard disk drive (HDD) containing a non-removable disk, the floppy disk drive (FDD) and its removable floppy disk, and various optical disc drives (ODD) and associated optical disc media."
    ]
  },
  {
    "term": "distributed computing",
    "explanations": [
      "A field of computer science that studies distributed systems. A distributed system is a system whose components are located on different networked computers, which communicate and coordinate their actions by passing messages to one another. The components interact with one another in order to achieve a common goal. Three significant characteristics of distributed systems are: concurrency of components, lack of a global clock, and independent failure of components. Examples of distributed systems vary from SOA-based systems to massively multiplayer online games to peer-to-peer applications."
    ]
  },
  {
    "term": "divide and conquer algorithm",
    "explanations": [
      "An algorithm design paradigm based on multi-branched recursion. A divide-and-conquer algorithm works by recursively breaking down a problem into two or more sub-problems of the same or related type, until these become simple enough to be solved directly. The solutions to the sub-problems are then combined to give a solution to the original problem."
    ]
  },
  {
    "term": "DNS",
    "explanations": ["See Domain Name System."]
  },
  {
    "term": "documentation",
    "explanations": [
      "Written text or illustration that accompanies computer software or is embedded in the source code. It either explains how it operates or how to use it, and may mean different things to people in different roles."
    ]
  },
  {
    "term": "domain",
    "explanations": [
      "Is the targeted subject area of a computer program. It is a term used in software engineering. Formally it represents the target subject of a specific programming project, whether narrowly or broadly defined."
    ]
  },
  {
    "term": "Domain Name System",
    "explanations": []
  },
  {
    "term": "double-precision floating-point format",
    "explanations": [
      "A computer number format. It represents a wide dynamic range of numerical values by using a floating radix point."
    ]
  },
  {
    "term": "download",
    "explanations": [
      "In computer networks, to receive data from a remote system, typically a server such as a web server, an FTP server, an email server, or other similar systems. This contrasts with uploading, where data is sent to a remote server. A download is a file offered for downloading or that has been downloaded, or the process of receiving such a file."
    ]
  },
  {
    "term": "edge device",
    "explanations": [
      "A device which provides an entry point into enterprise or service provider core networks. Examples include routers, routing switches, integrated access devices (IADs), multiplexers, and a variety of metropolitan area network (MAN) and wide area network (WAN) access devices. Edge devices also provide connections into carrier and service provider networks. An edge device that connects a local area network to a high speed switch or backbone (such as an ATM switch) may be called an edge concentrator."
    ]
  },
  {
    "term": "encryption",
    "explanations": [
      "In cryptography, encryption is the process of encoding information. This process converts the original representation of the information, known as plaintext, into an alternative form known as ciphertext. Ideally, only authorized parties can decipher a ciphertext back to plaintext and access the original information. Encryption does not itself prevent interference but denies the intelligible content to a would-be interceptor. For technical reasons, an encryption scheme usually uses a pseudo-random encryption key generated by an algorithm. It is possible to decrypt the message without possessing the key, but, for a well-designed encryption scheme, considerable computational resources and skills are required. An authorized recipient can easily decrypt the message with the key provided by the originator to recipients but not to unauthorized users. Historically, various forms of encryption have been used to aid in cryptography. Early encryption techniques were often utilized in military messaging. Since then, new techniques have emerged and become commonplace in all areas of modern computing. Modern encryption schemes utilize the concepts of public-key and symmetric-key. Modern encryption techniques ensure security because modern computers are inefficient at cracking the encryption."
    ]
  },
  {
    "term": "event",
    "explanations": [
      "An action or occurrence recognized by software, often originating asynchronously from the external environment, that may be handled by the software. Because an event is an entity which encapsulates the action and the contextual variables triggering the action, the acrostic mnemonic \"Execution Variable Encapsulating Named Trigger\" is often used to clarify the concept."
    ]
  },
  {
    "term": "event-driven programming",
    "explanations": [
      "A programming paradigm in which the flow of the program is determined by events such as user actions (mouse clicks, key presses), sensor outputs, or messages from other programs or threads. Event-driven programming is the dominant paradigm used in graphical user interfaces and other applications (e.g. JavaScript web applications) that are centered on performing certain actions in response to user input. This is also true of programming for device drivers (e.g. P in USB device driver stacks)."
    ]
  },
  {
    "term": "evolutionary computing",
    "explanations": [
      "A family of algorithms for global optimization inspired by biological evolution, and the subfield of artificial intelligence and soft computing studying these algorithms. In technical terms, they are a family of population-based trial-and-error problem-solvers with a metaheuristic or stochastic optimization character."
    ]
  },
  {
    "term": "executable",
    "explanations": []
  },
  {
    "term": "execution",
    "explanations": [
      "In computer and software engineering is the process by which a computer or virtual machine executes the instructions of a computer program. Each instruction of a program is a description of a particular action which to be carried out in order for a specific problem to be solved; as instructions of a program and therefore the actions they describe are being carried out by an executing machine, specific effects are produced in accordance to the semantics of the instructions being executed."
    ]
  },
  {
    "term": "exception handling",
    "explanations": [
      "The process of responding to the occurrence, during computation, of exceptions  anomalous or exceptional conditions requiring special processing  often disrupting the normal flow of program execution. It is provided by specialized programming language constructs, computer hardware mechanisms like interrupts, or operating system IPC facilities like signals."
    ]
  },
  {
    "term": "Existence detection",
    "explanations": [
      "An existence check before reading a file can catch and/or prevent a fatal error."
    ]
  },
  {
    "term": "expression",
    "explanations": [
      "In a programming language, a combination of one or more constants, variables, operators, and functions that the programming language interprets (according to its particular rules of precedence and of association) and computes to produce (\"to return\", in a stateful environment) another value. This process, as for mathematical expressions, is called evaluation."
    ]
  },
  {
    "term": "fault-tolerant computer system",
    "explanations": [
      "A system designed around the concept of fault tolerance. In essence, they must be able to continue working to a level of satisfaction in the presence of errors or breakdowns."
    ]
  },
  {
    "term": "feasibility study",
    "explanations": [
      "An investigation which aims to objectively and rationally uncover the strengths and weaknesses of an existing business or proposed venture, opportunities and threats present in the natural environment, the resources required to carry through, and ultimately the prospects for success. In its simplest terms, the two criteria to judge feasibility are cost required and value to be attained."
    ]
  },
  {
    "term": "field",
    "explanations": [
      "Data that has several parts, known as a record, can be divided into fields. Relational databases arrange data as sets of database records, so called rows. Each record consists of several fields; the fields of all records form the columns. Examples of fields: name, gender, hair colour."
    ]
  },
  {
    "term": "filename extension",
    "explanations": [
      "An identifier specified as a suffix to the name of a computer file. The extension indicates a characteristic of the file contents or its intended use."
    ]
  },
  {
    "term": "filter (software)",
    "explanations": [
      "A computer program or subroutine to process a stream, producing another stream. While a single filter can be used individually, they are frequently strung together to form a pipeline."
    ]
  },
  {
    "term": "floating point arithmetic",
    "explanations": [
      "In computing, floating-point arithmetic (FP) is arithmetic using formulaic representation of real numbers as an approximation to support a trade-off between range and precision. For this reason, floating-point computation is often found in systems which include very small and very large real numbers, which require fast processing times. A number is, in general, represented approximately to a fixed number of significant digits (the significand) and scaled using an exponent in some fixed base; the base for the scaling is normally two, ten, or sixteen."
    ]
  },
  {
    "term": "for loop",
    "explanations": []
  },
  {
    "term": "formal methods",
    "explanations": [
      "A set of mathematically based techniques for the specification, development, and verification of software and hardware systems. The use of formal methods for software and hardware design is motivated by the expectation that, as in other engineering disciplines, performing appropriate mathematical analysis can contribute to the reliability and robustness of a design."
    ]
  },
  {
    "term": "formal verification",
    "explanations": [
      "The act of proving or disproving the correctness of intended algorithms underlying a system with respect to a certain formal specification or property, using formal methods of mathematics."
    ]
  },
  {
    "term": "functional programming",
    "explanations": [
      "A programming paradigm a style of building the structure and elements of computer programs that treats computation as the evaluation of mathematical functions and avoids changing-state and mutable data. It is a declarative programming paradigm in that programming is done with expressions or declarations instead of statements."
    ]
  },
  {
    "term": "game theory",
    "explanations": [
      "The study of mathematical models of strategic interaction between rational decision-makers. It has applications in all fields of social science, as well as in logic and computer science. Originally, it addressed zero-sum games, in which each participant's gains or losses are exactly balanced by those of the other participants. Today, game theory applies to a wide range of behavioral relations, and is now an umbrella term for the science of logical decision making in humans, animals, and computers."
    ]
  },
  {
    "term": "garbage in, garbage out",
    "explanations": [
      "A term used to describe the concept that flawed or nonsense input data produces nonsense output or \"garbage\". It can also refer to the unforgiving nature of programming, in which a poorly written program might produce nonsensical behavior."
    ]
  },
  {
    "term": "Graphics Interchange Format",
    "explanations": [""]
  },
  {
    "term": "gigabyte",
    "explanations": [
      "A multiple of the unit byte for digital information. The prefix giga means 109 in the International System of Units (SI). Therefore, one gigabyte is 1000000000bytes. The unit symbol for the gigabyte is GB."
    ]
  },
  {
    "term": "global variable",
    "explanations": [
      "In computer programming, a variable with global scope, meaning that it is visible (hence accessible) throughout the program, unless shadowed. The set of all global variables is known as the global environment or global state. In compiled languages, global variables are generally static variables, whose extent (lifetime) is the entire runtime of the program, though in interpreted languages (including command-line interpreters), global variables are generally dynamically allocated when declared, since they are not known ahead of time."
    ]
  },
  {
    "term": "graph theory",
    "explanations": [
      "In mathematics, the study of graphs, which are mathematical structures used to model pairwise relations between objects. A graph in this context is made up of vertices (also called nodes or points) which are connected by edges (also called links or lines). A distinction is made between undirected graphs, where edges link two vertices symmetrically, and directed graphs, where edges link two vertices asymmetrically."
    ]
  },
  {
    "term": "handle",
    "explanations": [
      "In computer programming, a handle is an abstract reference to a resource that is used when application software references blocks of memory or objects that are managed by another system like a database or an operating system."
    ]
  },
  {
    "term": "hard problem",
    "explanations": [
      "Computational complexity theory focuses on classifying computational problems according to their inherent difficulty, and relating these classes to each other. A computational problem is a task solved by a computer. A computation problem is solvable by mechanical application of mathematical steps, such as an algorithm."
    ]
  },
  {
    "term": "hash function",
    "explanations": [
      "Any function that can be used to map data of arbitrary size to data of a fixed size. The values returned by a hash function are called hash values, hash codes, digests, or simply hashes. Hash functions are often used in combination with a hash table, a common data structure used in computer software for rapid data lookup. Hash functions accelerate table or database lookup by detecting duplicated records in a large file."
    ]
  },
  {
    "term": "hash table",
    "explanations": [
      "In computing, a hash table (hash map) is a data structure that implements an associative array abstract data type, a structure that can map keys to values. A hash table uses a hash function to compute an index into an array of buckets or slots, from which the desired value can be found."
    ]
  },
  {
    "term": "heap",
    "explanations": [
      "A specialized tree-based data structure which is essentially an almost complete tree that satisfies the heap property: if P is a parent node of C, then the key (the value) of P is either greater than or equal to (in a max heap) or less than or equal to (in a min heap) the key of C. The node at the \"top\" of the heap (with no parents) is called the root node."
    ]
  },
  {
    "term": "heapsort",
    "explanations": [
      "A comparison-based sorting algorithm. Heapsort can be thought of as an improved selection sort: like that algorithm, it divides its input into a sorted and an unsorted region, and it iteratively shrinks the unsorted region by extracting the largest element and moving that to the sorted region. The improvement consists of the use of a heap data structure rather than a linear-time search to find the maximum."
    ]
  },
  {
    "term": "human-computer interaction",
    "explanations": [
      "Researches the design and use of computer technology, focused on the interfaces between people (users) and computers. Researchers in the field of HCI both observe the ways in which humans interact with computers and design technologies that let humans interact with computers in novel ways. As a field of research, human computer interaction is situated at the intersection of computer science, behavioral sciences, design, media studies, and several other fields of study."
    ]
  },
  {
    "term": "identifier",
    "explanations": [
      "In computer languages, identifiers are tokens (also called symbols) which name language entities. Some of the kinds of entities an identifier might denote include variables, types, labels, subroutines, and packages."
    ]
  },
  {
    "term": "IDE",
    "explanations": ["Integrated development environment."]
  },
  {
    "term": "image processing",
    "explanations": [""]
  },
  {
    "term": "imperative programming",
    "explanations": [
      "A programming paradigm that uses statements that change a program's state. In much the same way that the imperative mood in natural languages expresses commands, an imperative program consists of commands for the computer to perform. Imperative programming focuses on describing how a program operates."
    ]
  },
  {
    "term": "incremental build model",
    "explanations": [
      "A method of software development where the product is designed, implemented and tested incrementally (a little more is added each time) until the product is finished. It involves both development and maintenance. The product is defined as finished when it satisfies all of its requirements. This model combines the elements of the waterfall model with the iterative philosophy of prototyping."
    ]
  },
  {
    "term": "information space analysis",
    "explanations": [
      "A deterministic method, enhanced by machine intelligence, for locating and assessing resources for team-centric efforts."
    ]
  },
  {
    "term": "information visualization",
    "explanations": [""]
  },
  {
    "term": "inheritance",
    "explanations": [
      "In object-oriented programming, the mechanism of basing an object or class upon another object (prototype-based inheritance) or class (class-based inheritance), retaining similar implementation. Also defined as deriving new classes (sub classes) from existing ones (super class or base class) and forming them into a hierarchy of classes."
    ]
  },
  {
    "term": "input/output",
    "explanations": []
  },
  {
    "term": "insertion sort",
    "explanations": [
      "A simple sorting algorithm that builds the final sorted array (or list) one item at a time."
    ]
  },
  {
    "term": "instruction cycle",
    "explanations": []
  },
  {
    "term": "integer",
    "explanations": [
      "A datum of integral data type, a data type that represents some range of mathematical integers. Integral data types may be of different sizes and may or may not be allowed to contain negative values. Integers are commonly represented in a computer as a group of binary digits (bits). The size of the grouping varies so the set of integer sizes available varies between different types of computers. Computer hardware, including virtual machines, nearly always provide a way to represent a processor register or memory address as an integer."
    ]
  },
  {
    "term": "integrated development environment",
    "explanations": []
  },
  {
    "term": "integration testing",
    "explanations": [
      "(sometimes called integration and testing, abbreviated I&T) is the phase in software testing in which individual software modules are combined and tested as a group. Integration testing is conducted to evaluate the compliance of a system or component with specified functional requirements. It occurs after unit testing and before validation testing. Integration testing takes as its input modules that have been unit tested, groups them in larger aggregates, applies tests defined in an integration test plan to those aggregates, and delivers as its output the integrated system ready for system testing."
    ]
  },
  {
    "term": "intellectual property",
    "explanations": []
  },
  {
    "term": "intelligent agent",
    "explanations": [
      "In artificial intelligence, an intelligent agent (IA) refers to an autonomous entity which acts, directing its activity towards achieving goals (i.e. it is an agent), upon an environment using observation through sensors and consequent actuators (i.e. it is intelligent). Intelligent agents may also learn or use knowledge to achieve their goals. They may be very simple or very complex. A reflex machine, such as a thermostat, is considered an example of an intelligent agent."
    ]
  },
  {
    "term": "interface",
    "explanations": [
      "A shared boundary across which two or more separate components of a computer system exchange information. The exchange can be between software, computer hardware, peripheral devices, humans, and combinations of these. Some computer hardware devices, such as a touchscreen, can both send and receive data through the interface, while others such as a mouse or microphone may only provide an interface to send data to a given system."
    ]
  },
  {
    "term": "internal documentation",
    "explanations": [
      "Computer software is said to have Internal Documentation if the notes on how and why various parts of code operate is included within the source code as comments. It is often combined with meaningful variable names with the intention of providing potential future programmers a means of understanding the workings of the code. This contrasts with external documentation, where programmers keep their notes and explanations in a separate document."
    ]
  },
  {
    "term": "internet",
    "explanations": [
      "The global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link devices worldwide. It is a network of networks that consists of private, public, academic, business, and government networks of local to global scope, linked by a broad array of electronic, wireless, and optical networking technologies."
    ]
  },
  {
    "term": "internet bot",
    "explanations": []
  },
  {
    "term": "interpreter",
    "explanations": [
      "A computer program that directly executes instructions written in a programming or scripting language, without requiring them to have been previously compiled into a machine language program."
    ]
  },
  {
    "term": "invariant",
    "explanations": [
      "One can encounter invariants that can be relied upon to be true during the execution of a program, or during some portion of it. It is a logical assertion that is always held to be true during a certain phase of execution. For example, a loop invariant is a condition that is true at the beginning and the end of every execution of a loop."
    ]
  },
  {
    "term": "iteration",
    "explanations": [
      "Is the repetition of a process in order to generate an outcome. The sequence will approach some end point or end value. Each repetition of the process is a single iteration, and the outcome of each iteration is then the starting point of the next iteration. In mathematics and computer science, iteration (along with the related technique of recursion) is a standard element of algorithms."
    ]
  },
  {
    "term": "Java",
    "explanations": [
      "A general-purpose programming language that is class-based, object-oriented(although not a pure OO language), and designed to have as few implementation dependencies as possible. It is intended to let application developers \"write once, run anywhere\" (WORA), meaning that compiled Java code can run on all platforms that support Java without the need for recompilation."
    ]
  },
  {
    "term": "kernel",
    "explanations": [
      "The first section of an operating system to load into memory. As the center of the operating system, the kernel needs to be small, efficient, and loaded into a protected area in the memory so that it cannot be overwritten. It may be responsible for such essential tasks as disk drive management, file management, memory management, process management, etc."
    ]
  },
  {
    "term": "library (computing)",
    "explanations": [
      "A collection of non-volatile resources used by computer programs, often for software development. These may include configuration data, documentation, help data, message templates, pre-written code and subroutines, classes, values, or type specifications."
    ]
  },
  {
    "term": "linear search",
    "explanations": []
  },
  {
    "term": "linked list",
    "explanations": [
      "A linear collection of data elements, whose order is not given by their physical placement in memory. Instead, each element points to the next. It is a data structure consisting of a collection of nodes which together represent a sequence."
    ]
  },
  {
    "term": "linker",
    "explanations": [
      "or link editor, is a computer utility program that takes one or more object files generated by a compiler or an assembler and combines them into a single executable file, library file, or another 'object' file. A simpler version that writes its output directly to memory is called the loader, though loading is typically considered a separate process."
    ]
  },
  {
    "term": "list",
    "explanations": [
      "An abstract data type that represents a countable number of ordered values, where the same value may occur more than once. An instance of a list is a computer representation of the mathematical concept of a finite sequence; the (potentially) infinite analog of a list is a stream. Lists are a basic example of containers, as they contain other values. If the same value occurs multiple times, each occurrence is considered a distinct item."
    ]
  },
  {
    "term": "loader",
    "explanations": [
      "The part of an operating system that is responsible for loading programs and libraries. It is one of the essential stages in the process of starting a program, as it places programs into memory and prepares them for execution. Loading a program involves reading the contents of the executable file containing the program instructions into memory, and then carrying out other required preparatory tasks to prepare the executable for running. Once loading is complete, the operating system starts the program by passing control to the loaded program code."
    ]
  },
  {
    "term": "logic error",
    "explanations": [
      "In computer programming, a bug in a program that causes it to operate incorrectly, but not to terminate abnormally (or crash). A logic error produces unintended or undesired output or other behaviour, although it may not immediately be recognized as such."
    ]
  },
  {
    "term": "logic programming",
    "explanations": [
      "A type of programming paradigm which is largely based on formal logic. Any program written in a logic programming language is a set of sentences in logical form, expressing facts and rules about some problem domain. Major logic programming language families include Prolog, answer set programming (ASP), and Datalog."
    ]
  },
  {
    "term": "machine learning",
    "explanations": []
  },
  {
    "term": "machine vision",
    "explanations": []
  },
  {
    "term": "mathematical logic",
    "explanations": [
      "A subfield of mathematics exploring the applications of formal logic to mathematics. It bears close connections to metamathematics, the foundations of mathematics, and theoretical computer science. The unifying themes in mathematical logic include the study of the expressive power of formal systems and the deductive power of formal proof systems."
    ]
  },
  {
    "term": "matrix",
    "explanations": [
      "In mathematics, a matrix, (plural matrices), is a rectangular array (see irregular matrix) of numbers, symbols, or expressions, arranged in rows and columns."
    ]
  },
  {
    "term": "memory",
    "explanations": [
      "Computer data storage, often called storage, is a technology consisting of computer components and recording media that are used to retain digital data. It is a core function and fundamental component of computers."
    ]
  },
  {
    "term": "merge sort",
    "explanations": []
  },
  {
    "term": "method",
    "explanations": [
      "In object-oriented programming (OOP), a procedure associated with a message and an object. An object consists of data and behavior. The data and behavior comprise an interface, which specifies how the object may be utilized by any of various consumers of the object."
    ]
  },
  {
    "term": "methodology",
    "explanations": [
      "In software engineering, a software development process is the process of dividing software development work into distinct phases to improve design, product management, and project management. It is also known as a software development life cycle (SDLC). The methodology may include the pre-definition of specific deliverables and artifacts that are created and completed by a project team to develop or maintain an application."
    ]
  },
  {
    "term": "modem",
    "explanations": []
  },
  {
    "term": "natural language processing",
    "explanations": [
      "A subfield of linguistics, computer science, information engineering, and artificial intelligence concerned with the interactions between computers and human (natural) languages, in particular how to program computers to process and analyze large amounts of natural language data. Challenges in natural language processing frequently involve speech recognition, natural language understanding, and natural language generation."
    ]
  },
  {
    "term": "node",
    "explanations": [
      "Is a basic unit of a data structure, such as a linked list or tree data structure. Nodes contain data and also may link to other nodes. Links between nodes are often implemented by pointers."
    ]
  },
  {
    "term": "number theory",
    "explanations": [
      "A branch of pure mathematics devoted primarily to the study of the integers and integer-valued functions."
    ]
  },
  {
    "term": "numerical analysis",
    "explanations": [
      "The study of algorithms that use numerical approximation (as opposed to symbolic manipulations) for the problems of mathematical analysis (as distinguished from discrete mathematics)."
    ]
  },
  {
    "term": "numerical method",
    "explanations": [
      "In numerical analysis, a numerical method is a mathematical tool designed to solve numerical problems. The implementation of a numerical method with an appropriate convergence check in a programming language is called a numerical algorithm."
    ]
  },
  {
    "term": "object",
    "explanations": [
      "An object can be a variable, a data structure, a function, or a method, and as such, is a value in memory referenced by an identifier. In the class-based object-oriented programming paradigm, object refers to a particular instance of a class, where the object can be a combination of variables, functions, and data structures. In relational database management, an object can be a table or column, or an association between data and a database entity (such as relating a person's age to a specific person)."
    ]
  },
  {
    "term": "object code",
    "explanations": []
  },
  {
    "term": "object-oriented analysis and design",
    "explanations": []
  },
  {
    "term": "object-oriented programming",
    "explanations": []
  },
  {
    "term": "open-source software",
    "explanations": []
  },
  {
    "term": "operating system",
    "explanations": []
  },
  {
    "term": "optical fiber",
    "explanations": [
      "A flexible, transparent fiber made by drawing glass (silica) or plastic to a diameter slightly thicker than that of a human hair. Optical fibers are used most often as a means to transmit light between the two ends of the fiber and find wide usage in fiber-optic communications, where they permit transmission over longer distances and at higher bandwidths (data rates) than electrical cables. Fibers are used instead of metal wires because signals travel along them with less loss; in addition, fibers are immune to electromagnetic interference, a problem from which metal wires suffer."
    ]
  },
  {
    "term": "pair programming",
    "explanations": [
      "An agile software development technique in which two programmers work together at one workstation. One, the driver, writes code while the other, the observer or navigator, reviews each line of code as it is typed in. The two programmers switch roles frequently."
    ]
  },
  {
    "term": "parallel computing",
    "explanations": [
      "A type of computation in which many calculations or the execution of processes are carried out simultaneously. Large problems can often be divided into smaller ones, which can then be solved at the same time. There are several different forms of parallel computing: bit-level, instruction-level, data, and task parallelism."
    ]
  },
  {
    "term": "parameter",
    "explanations": []
  },
  {
    "term": "peripheral",
    "explanations": [
      "Any auxiliary or ancillary device connected to or integrated within a computer system and used to send information to or retrieve information from the computer. An input device sends data or instructions to the computer; an output device provides output from the computer to the user; and an input/output device performs both functions."
    ]
  },
  {
    "term": "pointer",
    "explanations": [
      "Is an object in many programming languages that stores a memory address. This can be that of another value located in computer memory, or in some cases, that of memory-mapped computer hardware. A pointer references a location in memory, and obtaining the value stored at that location is known as dereferencing the pointer. As an analogy, a page number in a book's index could be considered a pointer to the corresponding page; dereferencing such a pointer would be done by flipping to the page with the given page number and reading the text found on that page. The actual format and content of a pointer variable is dependent on the underlying computer architecture."
    ]
  },
  {
    "term": "postcondition",
    "explanations": [
      "In computer programming, a condition or predicate that must always be true just after the execution of some section of code or after an operation in a formal specification. Postconditions are sometimes tested using assertions within the code itself. Often, postconditions are simply included in the documentation of the affected section of code."
    ]
  },
  {
    "term": "precondition",
    "explanations": [
      "In computer programming, a condition or predicate that must always be true just prior to the execution of some section of code or before an operation in a formal specification. If a precondition is violated, the effect of the section of code becomes undefined and thus may or may not carry out its intended work. Security problems can arise due to incorrect preconditions."
    ]
  },
  {
    "term": "primary storage",
    "explanations": [
      "(Also known as main memory, internal memory or prime memory), often referred to simply as memory, is the only one directly accessible to the CPU. The CPU continuously reads instructions stored there and executes them as required. Any data actively operated on is also stored there in uniform manner."
    ]
  },
  {
    "term": "primitive data type",
    "explanations": [""]
  },
  {
    "term": "priority queue",
    "explanations": [
      "An abstract data type which is like a regular queue or stack data structure, but where additionally each element has a \"priority\" associated with it. In a priority queue, an element with high priority is served before an element with low priority. In some implementations, if two elements have the same priority, they are served according to the order in which they were enqueued, while in other implementations, ordering of elements with the same priority is undefined."
    ]
  },
  {
    "term": "procedural programming",
    "explanations": [""]
  },
  {
    "term": "procedure",
    "explanations": [
      "In computer programming, a subroutine is a sequence of program instructions that performs a specific task, packaged as a unit. This unit can then be used in programs wherever that particular task should be performed. Subroutines may be defined within programs, or separately in libraries that can be used by many programs. In different programming languages, a subroutine may be called a routine, subprogram, function, method, or procedure. Technically, these terms all have different definitions. The generic, umbrella term callable unit is sometimes used."
    ]
  },
  {
    "term": "program lifecycle phase",
    "explanations": [
      "Program lifecycle phases are the stages a computer program undergoes, from initial creation to deployment and execution. The phases are edit time, compile time, link time, distribution time, installation time, load time, and run time."
    ]
  },
  {
    "term": "programming language",
    "explanations": [
      "A formal language, which comprises a set of instructions that produce various kinds of output. Programming languages are used in computer programming to implement algorithms."
    ]
  },
  {
    "term": "programming language implementation",
    "explanations": [
      "Is a system for executing computer programs. There are two general approaches to programming language implementation: interpretation and compilation."
    ]
  },
  {
    "term": "programming language theory",
    "explanations": [
      "(PLT) is a branch of computer science that deals with the design, implementation, analysis, characterization, and classification of programming languages and of their individual features. It falls within the discipline of computer science, both depending on and affecting mathematics, software engineering, linguistics and even cognitive science. It has become a well-recognized branch of computer science, and an active research area, with results published in numerous journals dedicated to PLT, as well as in general computer science and engineering publications."
    ]
  },
  {
    "term": "Prolog",
    "explanations": [
      "Is a logic programming language associated with artificial intelligence and computational linguistics. Prolog has its roots in first-order logic, a formal logic, and unlike many other programming languages, Prolog is intended primarily as a declarative programming language: the program logic is expressed in terms of relations, represented as facts and rules. A computation is initiated by running a query over these relations."
    ]
  },
  {
    "term": "Python",
    "explanations": [
      "Is an interpreted, high-level and general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python's design philosophy emphasizes code readability with its notable use of significant whitespace. Its language constructs and object-oriented approach aim to help programmers write clear, logical code for small and large-scale projects."
    ]
  },
  {
    "term": "quantum computing",
    "explanations": [
      "The use of quantum-mechanical phenomena such as superposition and entanglement to perform computation. A quantum computer is used to perform such computation, which can be implemented theoretically or physically."
    ]
  },
  {
    "term": "queue",
    "explanations": [
      "A collection in which the entities in the collection are kept in order and the principal (or only) operations on the collection are the addition of entities to the rear terminal position, known as enqueue, and removal of entities from the front terminal position, known as dequeue."
    ]
  },
  {
    "term": "quicksort",
    "explanations": []
  },
  {
    "term": "R programming language",
    "explanations": [
      "R is a programming language and free software environment for statistical computing and graphics supported by the R Foundation for Statistical Computing. The R language is widely used among statisticians and data miners for developing statistical software and data analysis."
    ]
  },
  {
    "term": "radix",
    "explanations": []
  },
  {
    "term": "record",
    "explanations": [
      "A record (also called a structure, struct, or compound data) is a basic data structure. Records in a database or spreadsheet are usually called \"rows\"."
    ]
  },
  {
    "term": "recursion",
    "explanations": [
      "Occurs when a thing is defined in terms of itself or of its type. Recursion is used in a variety of disciplines ranging from linguistics to logic. The most common application of recursion is in mathematics and computer science, where a function being defined is applied within its own definition. While this apparently defines an infinite number of instances (function values), it is often done in such a way that no infinite loop or infinite chain of references can occur."
    ]
  },
  {
    "term": "reference",
    "explanations": [
      "Is a value that enables a program to indirectly access a particular datum, such as a variable's value or a record, in the computer's memory or in some other storage device. The reference is said to refer to the datum, and accessing the datum is called dereferencing the reference."
    ]
  },
  {
    "term": "reference counting",
    "explanations": [
      "A programming technique of storing the number of references, pointers, or handles to a resource, such as an object, a block of memory, disk space, and others. In garbage collection algorithms, reference counts may be used to deallocate objects which are no longer needed."
    ]
  },
  {
    "term": "relational database",
    "explanations": [
      "Is a digital database based on the relational model of data, as proposed by E. F. Codd in 1970. A software system used to maintain relational databases is a relational database management system (RDBMS). Many relational database systems have an option of using the SQL (Structured Query Language) for querying and maintaining the database.[better source needed]"
    ]
  },
  {
    "term": "reliability engineering",
    "explanations": [
      "A sub-discipline of systems engineering that emphasizes dependability in the lifecycle management of a product. Reliability describes the ability of a system or component to function under stated conditions for a specified period of time. Reliability is closely related to availability, which is typically described as the ability of a component or system to function at a specified moment or interval of time."
    ]
  },
  {
    "term": "regression testing",
    "explanations": [
      "(rarely non-regression testing) is re-running functional and non-functional tests to ensure that previously developed and tested software still performs after a change. If not, that would be called a regression. Changes that may require regression testing include bug fixes, software enhancements, configuration changes, and even substitution of electronic components. As regression test suites tend to grow with each found defect, test automation is frequently involved. Sometimes a change impact analysis is performed to determine an appropriate subset of tests (non-regression analysis)."
    ]
  },
  {
    "term": "requirements analysis",
    "explanations": [
      "In systems engineering and software engineering, requirements analysis focuses on the tasks that determine the needs or conditions to meet the new or altered product or project, taking account of the possibly conflicting requirements of the various stakeholders, analyzing, documenting, validating and managing software or system requirements."
    ]
  },
  {
    "term": "robotics",
    "explanations": [
      "An interdisciplinary branch of engineering and science that includes mechanical engineering, electronic engineering, information engineering, computer science, and others. Robotics involves design, construction, operation, and use of robots, as well as computer systems for their perception, control, sensory feedback, and information processing. The goal of robotics is to design intelligent machines that can help and assist humans in their day-to-day lives and keep everyone safe."
    ]
  },
  {
    "term": "round-off error",
    "explanations": []
  },
  {
    "term": "router",
    "explanations": [
      "A networking device that forwards data packets between computer networks. Routers perform the traffic directing functions on the Internet. Data sent through the internet, such as a web page or email, is in the form of data packets.  A packet is typically forwarded from one router to another router through the networks that constitute an internetwork (e.g. the Internet) until it reaches its destination node."
    ]
  },
  {
    "term": "routing table",
    "explanations": [
      "In computer networking a routing table, or routing information base (RIB), is a data table stored in a router or a network host that lists the routes to particular network destinations, and in some cases, metrics (distances) associated with those routes. The routing table contains information about the topology of the network immediately around it."
    ]
  },
  {
    "term": "run time",
    "explanations": [
      "Runtime, run time, or execution time is the final phase of a computer program's life cycle, in which the code is being executed on the computer's central processing unit (CPU) as machine code. In other words, \"runtime\" is the running phase of a program."
    ]
  },
  {
    "term": "run time error",
    "explanations": [
      "A runtime error is detected after or during the execution (running state) of a program, whereas a compile-time error is detected by the compiler before the program is ever executed. Type checking, register allocation, code generation, and code optimization are typically done at compile time, but may be done at runtime depending on the particular language and compiler. Many other runtime errors exist and are handled differently by different programming languages, such as division by zero errors, domain errors, array subscript out of bounds errors, arithmetic underflow errors, several types of underflow and overflow errors, and many other runtime errors generally considered as software bugs which may or may not be caught and handled by any particular computer language."
    ]
  },
  {
    "term": "search algorithm",
    "explanations": [
      "Any algorithm which solves the search problem, namely, to retrieve information stored within some data structure, or calculated in the search space of a problem domain, either with discrete or continuous values."
    ]
  },
  {
    "term": "secondary storage",
    "explanations": [
      "Also known as external memory or auxiliary storage, differs from primary storage in that it is not directly accessible by the CPU. The computer usually uses its input/output channels to access secondary storage and transfer the desired data to primary storage. Secondary storage is non-volatile (retaining data when power is shut off). Modern computer systems typically have two orders of magnitude more secondary storage than primary storage because secondary storage is less expensive."
    ]
  },
  {
    "term": "selection sort",
    "explanations": [
      "Is an in-place comparison sorting algorithm. It has an O(n2) time complexity, which makes it inefficient on large lists, and generally performs worse than the similar insertion sort. Selection sort is noted for its simplicity and has performance advantages over more complicated algorithms in certain situations, particularly where auxiliary memory is limited."
    ]
  },
  {
    "term": "semantics",
    "explanations": [
      "In programming language theory, semantics is the field concerned with the rigorous mathematical study of the meaning of programming languages. It does so by evaluating the meaning of syntactically valid strings defined by a specific programming language, showing the computation involved. In such a case that the evaluation would be of syntactically invalid strings, the result would be non-computation. Semantics describes the processes a computer follows when executing a program in that specific language. This can be shown by describing the relationship between the input and output of a program, or an explanation of how the program will be executed on a certain platform, hence creating a model of computation."
    ]
  },
  {
    "term": "sequence",
    "explanations": [
      "In mathematics, a sequence is an enumerated collection of objects in which repetitions are allowed and order does matter. Like a set, it contains members (also called elements, or terms). The number of elements (possibly infinite) is called the length of the sequence. Unlike a set, the same elements can appear multiple times at different positions in a sequence, and order does matter. Formally, a sequence can be defined as a function whose domain is either the set of the natural numbers (for infinite sequences) or the set of the first n natural numbers (for a sequence of finite length n). The position of an element in a sequence is its rank or index; it is the natural number for which the element is the image. The first element has index 0 or 1, depending on the context or a specific convention. When a symbol is used to denote a sequence, the nth element of the sequence is denoted by this symbol with n as subscript; for example, the nth element of the Fibonacci sequence F is generally denoted Fn. For example, (M, A, R, Y) is a sequence of letters with the letter 'M' first and 'Y' last. This sequence differs from (A, R, M, Y). Also, the sequence (1, 1, 2, 3, 5, 8), which contains the number 1 at two different positions, is a valid sequence. Sequences can be finite, as in these examples, or infinite, such as the sequence of all even positive integers (2, 4, 6, ...). In computing and computer science, finite sequences are sometimes called strings, words or lists, the different names commonly corresponding to different ways to represent them in computer memory; infinite sequences are called streams. The empty sequence ( ) is included in most notions of sequence, but may be excluded depending on the context."
    ]
  },
  {
    "term": "serializability",
    "explanations": [
      "In concurrency control of databases, transaction processing (transaction management), and various transactional applications (e.g., transactional memory and software transactional memory), both centralized and distributed, a transaction schedule is serializable if its outcome (e.g., the resulting database state) is equal to the outcome of its transactions executed serially, i.e. without overlapping in time. Transactions are normally executed concurrently (they overlap), since this is the most efficient way. Serializability is the major correctness criterion for concurrent transactions' executions[citation needed]. It is considered the highest level of isolation between transactions, and plays an essential role in concurrency control. As such it is supported in all general purpose database systems. Strong strict two-phase locking (SS2PL) is a popular serializability mechanism utilized in most of the database systems (in various variants) since their early days in the 1970s."
    ]
  },
  {
    "term": "serialization",
    "explanations": [
      "Is the process of translating data structures or object state into a format that can be stored (for example, in a file or memory buffer) or transmitted (for example, across a network connection link) and reconstructed later (possibly in a different computer environment). When the resulting series of bits is reread according to the serialization format, it can be used to create a semantically identical clone of the original object. For many complex objects, such as those that make extensive use of references, this process is not straightforward. Serialization of object-oriented objects does not include any of their associated methods with which they were previously linked. This process of serializing an object is also called marshalling an object in some situations. The opposite operation, extracting a data structure from a series of bytes, is deserialization, (also called unserialization or unmarshalling)."
    ]
  },
  {
    "term": "service level agreement",
    "explanations": [
      "(SLA), is a commitment between a service provider and a client. Particular aspects of the service  quality, availability, responsibilities  are agreed between the service provider and the service user. The most common component of an SLA is that the services should be provided to the customer as agreed upon in the contract. As an example, Internet service providers and telcos will commonly include service level agreements within the terms of their contracts with customers to define the level(s) of service being sold in plain language terms. In this case the SLA will typically have a technical definition in mean time between failures (MTBF), mean time to repair or mean time to recovery (MTTR); identifying which party is responsible for reporting faults or paying fees; responsibility for various data rates; throughput; jitter; or similar measurable details."
    ]
  },
  {
    "term": "set",
    "explanations": [
      "Is an abstract data type that can store unique values, without any particular order. It is a computer implementation of the mathematical concept of a finite set. Unlike most other collection types, rather than retrieving a specific element from a set, one typically tests a value for membership in a set."
    ]
  },
  {
    "term": "software",
    "explanations": [
      "Computer software, or simply software, is a collection of data or computer instructions that tell the computer how to work. This is in contrast to physical hardware, from which the system is built and actually performs the work. In computer science and software engineering, computer software is all information processed by computer systems, programs and data. Computer software includes computer programs, libraries and related non-executable data, such as online documentation or digital media. Computer hardware and software require each other and neither can be realistically used on its own."
    ]
  },
  {
    "term": "software agent",
    "explanations": [
      "Is a computer program that acts for a user or other program in a relationship of agency, which derives from the Latin agere (to do): an agreement to act on one's behalf. Such \"action on behalf of\" implies the authority to decide which, if any, action is appropriate. Agents are colloquially known as bots, from robot. They may be embodied, as when execution is paired with a robot body, or as software such as a chatbot executing on a phone (e.g. Siri) or other computing device. Software agents may be autonomous or work together with other agents or people. Software agents interacting with people (e.g. chatbots, human-robot interaction environments) may possess human-like qualities such as natural language understanding and speech, personality or embody humanoid form (see Asimo)."
    ]
  },
  {
    "term": "software construction",
    "explanations": [
      "Is a software engineering discipline. It is the detailed creation of working meaningful software through a combination of coding, verification, unit testing, integration testing, and debugging. It is linked to all the other software engineering disciplines, most strongly to software design and software testing."
    ]
  },
  {
    "term": "software deployment",
    "explanations": [
      "Is all of the activities that make a software system available for use."
    ]
  },
  {
    "term": "software design",
    "explanations": [
      "Is the process by which an agent creates a specification of a software artifact, intended to accomplish goals, using a set of primitive components and subject to constraints. Software design may refer to either \"all the activity involved in conceptualizing, framing, implementing, commissioning, and ultimately modifying complex systems\" or \"the activity following requirements specification and before programming, as ... [in] a stylized software engineering process.\""
    ]
  },
  {
    "term": "software development",
    "explanations": [
      "Is the process of conceiving, specifying, designing, programming, documenting, testing, and bug fixing involved in creating and maintaining applications, frameworks, or other software components. Software development is a process of writing and maintaining the source code, but in a broader sense, it includes all that is involved between the conception of the desired software through to the final manifestation of the software, sometimes in a planned and structured process. Therefore, software development may include research, new development, prototyping, modification, reuse, re-engineering, maintenance, or any other activities that result in software products."
    ]
  },
  {
    "term": "software development process",
    "explanations": [
      "In software engineering, a software development process is the process of dividing software development work into distinct phases to improve design, product management, and project management. It is also known as a software development life cycle (SDLC). The methodology may include the pre-definition of specific deliverables and artifacts that are created and completed by a project team to develop or maintain an application. Most modern development processes can be vaguely described as agile. Other methodologies include waterfall, prototyping, iterative and incremental development, spiral development, rapid application development, and extreme programming."
    ]
  },
  {
    "term": "software engineering",
    "explanations": [
      "Is the systematic application of engineering approaches to the development of software. Software engineering is a computing discipline."
    ]
  },
  {
    "term": "software maintenance",
    "explanations": [
      "In software engineering is the modification of a software product after delivery to correct faults, to improve performance or other attributes."
    ]
  },
  {
    "term": "software prototyping",
    "explanations": [
      "Is the activity of creating prototypes of software applications, i.e., incomplete versions of the software program being developed. It is an activity that can occur in software development and is comparable to prototyping as known from other fields, such as mechanical engineering or manufacturing. A prototype typically simulates only a few aspects of, and may be completely different from, the final product."
    ]
  },
  {
    "term": "software requirements specification",
    "explanations": [
      "(SRS), is a description of a software system to be developed. The software requirements specification lays out functional and non-functional requirements, and it may include a set of use cases that describe user interactions that the software must provide to the user for perfect interaction."
    ]
  },
  {
    "term": "software testing",
    "explanations": [
      "Is an investigation conducted to provide stakeholders with information about the quality of the software product or service under test. Software testing can also provide an objective, independent view of the software to allow the business to appreciate and understand the risks of software implementation. Test techniques include the process of executing a program or application with the intent of finding software bugs (errors or other defects), and verifying that the software product is fit for use."
    ]
  },
  {
    "term": "sorting algorithm",
    "explanations": [
      "Is an algorithm that puts elements of a list in a certain order. The most frequently used orders are numerical order and lexicographical order. Efficient sorting is important for optimizing the efficiency of other algorithms (such as search and merge algorithms) that require input data to be in sorted lists. Sorting is also often useful for canonicalizing data and for producing human-readable output. More formally, the output of any sorting algorithm must satisfy two conditions: The output is in nondecreasing order (each element is no smaller than the previous element according to the desired total order); The output is a permutation (a reordering, yet retaining all of the original elements) of the input. Further, the input data is often stored in an array, which allows random access, rather than a list, which only allows sequential access; though many algorithms can be applied to either type of data after suitable modification."
    ]
  },
  {
    "term": "source code",
    "explanations": [
      "In computing, source code is any collection of code, with or without comments, written using a human-readable programming language, usually as plain text. The source code of a program is specially designed to facilitate the work of computer programmers, who specify the actions to be performed by a computer mostly by writing source code. The source code is often transformed by an assembler or compiler into binary machine code that can be executed by the computer. The machine code might then be stored for execution at a later time. Alternatively, source code may be interpreted and thus immediately executed."
    ]
  },
  {
    "term": "spiral model",
    "explanations": [
      "Is a risk-driven software development process model. Based on the unique risk patterns of a given project, the spiral model guides a team to adopt elements of one or more process models, such as incremental, waterfall, or evolutionary prototyping."
    ]
  },
  {
    "term": "stack",
    "explanations": [
      "Is an abstract data type that serves as a collection of elements, with two main principal operations: push, which adds an element to the collection, and pop, which removes the most recently added element that was not yet removed. The order in which elements come off a stack gives rise to its alternative name, LIFO (last in, first out). Additionally, a peek operation may give access to the top without modifying the stack. The name \"stack\" for this type of structure comes from the analogy to a set of physical items stacked on top of each other. This structure makes it easy to take an item off the top of the stack, while getting to an item deeper in the stack may require taking off multiple other items first."
    ]
  },
  {
    "term": "state",
    "explanations": [
      "In information technology and computer science, a system is described as stateful if it is designed to remember preceding events or user interactions; the remembered information is called the state of the system."
    ]
  },
  {
    "term": "statement",
    "explanations": [
      "In computer programming, a statement is a syntactic unit of an imperative programming language that expresses some action to be carried out. A program written in such a language is formed by a sequence of one or more statements. A statement may have internal components (e.g., expressions)."
    ]
  },
  {
    "term": "storage",
    "explanations": [
      "Computer data storage is a technology consisting of computer components and recording media that are used to retain digital data. It is a core function and fundamental component of computers."
    ]
  },
  {
    "term": "stream",
    "explanations": [
      "Is a sequence of data elements made available over time. A stream can be thought of as items on a conveyor belt being processed one at a time rather than in large batches."
    ]
  },
  {
    "term": "string",
    "explanations": [
      "In computer programming, a string is traditionally a sequence of characters, either as a literal constant or as some kind of variable. The latter may allow its elements to be mutated and the length changed, or it may be fixed (after creation). A string is generally considered as a data type and is often implemented as an array data structure of bytes (or words) that stores a sequence of elements, typically characters, using some character encoding. String may also denote more general arrays or other sequence (or list) data types and structures."
    ]
  },
  {
    "term": "structured storage",
    "explanations": [
      "A NoSQL (originally referring to \"non-SQL\" or \"non-relational\") database provides a mechanism for storage and retrieval of data that is modeled in means other than the tabular relations used in relational databases. Such databases have existed since the late 1960s, but the name \"NoSQL\" was only coined in the early 21st century, triggered by the needs of Web 2.0 companies. NoSQL databases are increasingly used in big data and real-time web applications. NoSQL systems are also sometimes called \"Not only SQL\" to emphasize that they may support SQL-like query languages or sit alongside SQL databases in polyglot-persistent architectures."
    ]
  },
  {
    "term": "subroutine",
    "explanations": [
      "In computer programming, a subroutine is a sequence of program instructions that performs a specific task, packaged as a unit. This unit can then be used in programs wherever that particular task should be performed. Subroutines may be defined within programs, or separately in libraries that can be used by many programs. In different programming languages, a subroutine may be called a routine, subprogram, function, method, or procedure. Technically, these terms all have different definitions. The generic, umbrella term callable unit is sometimes used."
    ]
  },
  {
    "term": "symbolic computation",
    "explanations": [
      "In mathematics and computer science, computer algebra, also called symbolic computation or algebraic computation, is a scientific area that refers to the study and development of algorithms and software for manipulating mathematical expressions and other mathematical objects. Although computer algebra could be considered a subfield of scientific computing, they are generally considered as distinct fields because scientific computing is usually based on numerical computation with approximate floating point numbers, while symbolic computation emphasizes exact computation with expressions containing variables that have no given value and are manipulated as symbols."
    ]
  },
  {
    "term": "syntax",
    "explanations": [
      "The syntax of a computer language is the set of rules that defines the combinations of symbols that are considered to be correctly structured statements or expressions in that language. This applies both to programming languages, where the document represents source code, and to markup languages, where the document represents data."
    ]
  },
  {
    "term": "syntax error",
    "explanations": [
      "Is an error in the syntax of a sequence of characters or tokens that is intended to be written in compile-time. A program will not compile until all syntax errors are corrected. For interpreted languages, however, a syntax error may be detected during program execution, and an interpreter's error messages might not differentiate syntax errors from errors of other kinds. There is some disagreement as to just what errors are \"syntax errors\". For example, some would say that the use of an uninitialized variable's value in Java code is a syntax error, but many others would disagree and would classify this as a (static) semantic error."
    ]
  },
  {
    "term": "system console",
    "explanations": [
      "The system console, computer console, root console, operator's console, or simply console is the text entry and display device for system administration messages, particularly those from the BIOS or boot loader, the kernel, from the init system and from the system logger. It is a physical device consisting of a keyboard and a screen, and traditionally is a text terminal, but may also be a graphical terminal. System consoles are generalized to computer terminals, which are abstracted respectively by virtual consoles and terminal emulators. Today communication with system consoles is generally done abstractly, via the standard streams (stdin, stdout, and stderr), but there may be system-specific interfaces, for example those used by the system kernel."
    ]
  },
  {
    "term": "technical documentation",
    "explanations": [
      "In engineering, any type of documentation that describes handling, functionality, and architecture of a technical product or a product under development or use. The intended recipient for product technical documentation is both the (proficient) end user as well as the administrator/service or maintenance technician. In contrast to a mere \"cookbook\" manual, technical documentation aims at providing enough information for a user to understand inner and outer dependencies of the product at hand."
    ]
  },
  {
    "term": "third-generation programming language",
    "explanations": [
      "A third-generation programming language (3GL) is a high-level computer programming language that tends to be more machine-independent and programmer-friendly than the machine code of the first-generation and assembly languages of the second-generation, while having a less specific focus to the fourth and fifth generations. Examples of common and historical third-generation programming languages are ALGOL, BASIC, C, COBOL, Fortran, Java, and Pascal."
    ]
  },
  {
    "term": "top-down and bottom-up design",
    "explanations": [""]
  },
  {
    "term": "tree",
    "explanations": [
      "A widely used abstract data type (ADT) that simulates a hierarchical tree structure, with a root value and subtrees of children with a parent node, represented as a set of linked nodes."
    ]
  },
  {
    "term": "type theory",
    "explanations": [
      "In mathematics, logic, and computer science, a type theory is any of a class of formal systems, some of which can serve as alternatives to set theory as a foundation for all mathematics. In type theory, every \"term\" has a \"type\" and operations are restricted to terms of a certain type."
    ]
  },
  {
    "term": "upload",
    "explanations": [
      "In computer networks, to send data to a remote system such as a server or another client so that the remote system can store a copy. Contrast download."
    ]
  },
  {
    "term": "Uniform Resource Locator",
    "explanations": []
  },
  {
    "term": "user",
    "explanations": [
      "Is a person who utilizes a computer or network service. Users of computer systems and software products generally lack the technical expertise required to fully understand how they work. Power users use advanced features of programs, though they are not necessarily capable of computer programming and system administration."
    ]
  },
  {
    "term": "user agent",
    "explanations": [
      "Software (a software agent) that acts on behalf of a user, such as a web browser that \"retrieves, renders and facilitates end user interaction with Web content\". An email reader is a mail user agent."
    ]
  },
  {
    "term": "user interface",
    "explanations": []
  },
  {
    "term": "user interface design",
    "explanations": []
  },
  {
    "term": "variable",
    "explanations": [
      "In computer programming, a variable, or scalar, is a storage location (identified by a memory address) paired with an associated symbolic name (an identifier), which contains some known or unknown quantity of information referred to as a value. The variable name is the usual way to reference the stored value, in addition to referring to the variable itself, depending on the context. This separation of name and content allows the name to be used independently of the exact information it represents. The identifier in computer source code can be bound to a value during run time, and the value of the variable may therefore change during the course of program execution."
    ]
  },
  {
    "term": "virtual machine",
    "explanations": []
  },
  {
    "term": "V-Model",
    "explanations": [
      "A software development process that may be considered an extension of the waterfall model, and is an example of the more general V-model. Instead of moving down in a linear way, the process steps are bent upwards after the coding phase, to form the typical V shape. The V-Model demonstrates the relationships between each phase of the development life cycle and its associated phase of testing. The horizontal and vertical axes represent time or project completeness (left-to-right) and level of abstraction (coarsest-grain abstraction uppermost), respectively."
    ]
  },
  {
    "term": "waterfall model",
    "explanations": [
      "A breakdown of project activities into linear sequential phases, where each phase depends on the deliverables of the previous one and corresponds to a specialisation of tasks. The approach is typical for certain areas of engineering design. In software development, it tends to be among the less iterative and flexible approaches, as progress flows in largely one direction (\"downwards\" like a waterfall) through the phases of conception, initiation, analysis, design, construction, testing, deployment and maintenance."
    ]
  },
  {
    "term": "Waveform Audio File Format",
    "explanations": []
  },
  {
    "term": "web crawler",
    "explanations": []
  },
  {
    "term": "Wi-Fi",
    "explanations": [
      "A family of wireless networking technologies, based on the IEEE 802.11 family of standards, which are commonly used for local area networking of devices and Internet access. Wi-Fi is a trademark of the non-profit Wi-Fi Alliance, which restricts the use of the term Wi-Fi Certified to products that successfully complete interoperability certification testing."
    ]
  },
  {
    "term": "XHTML",
    "explanations": []
  }
]
