[
  "halcyon",
  "poltergeist",
  "kitsch",
  "doppelganger",
  "kaput",
  "verboten",
  "zeitgeist",
  "schadenfreude",
  "bildungsroman",
  "citadel",
  "burlesque",
  "pastiche",
  "archipelago",
  "salvo",
  "imbroglio",
  "littoral",
  "bravado",
  "manifesto",
  "ruffian",
  "dillettante",
  "cognoscenti",
  "intelligentsia",
  "guru",
  "bungalow",
  "pundit",
  "karma",
  "mantra",
  "avatar",
  "pariah",
  "wanderlust",
  "cosmopolitan",
  "insular",
  "provinicial",
  "jaunt",
  "parochial",
  "junket",
  "sedulous",
  "restive",
  "peruse",
  "punctillious",
  "equivocate",
  "predicament",
  "prepossessing",
  "gratituous",
  "intemperate",
  "burnish",
  "quiescent",
  "redress",
  "remiss",
  "preeminent",
  "mannerism",
  "placid",
  "rambunctious",
  "susurrus",
  "murmur",
  "racuous",
  "hubbub",
  "obstrepuous",
  "prudent",
  "wary",
  "impetuous",
  "heedless",
  "chary",
  "rash",
  "reticent",
  "verbose",
  "taciturn",
  "mince",
  "hedge",
  "loquacious",
  "palaver",
  "cornucopia",
  "legion",
  "surfeit",
  "glut",
  "multitude",
  "myriad",
  "plethora",
  "copious",
  "paucity",
  "superfluous",
  "wanting",
  "dearth",
  "modicum",
  "iota",
  "extraneous",
  "dogmatic",
  "didactic",
  "retract",
  "assertive",
  "repudiate",
  "adamant",
  "doctrinaire",
  "voracious",
  "ascetic",
  "abstemious",
  "insatiable",
  "sate",
  "gourmand",
  "ravenous",
  "hoodwink",
  "charlatan",
  "steadfast",
  "bilk",
  "ruse",
  "bamboozle",
  "stalwart",
  "fidelity",
  "laud",
  "lionize",
  "deprecate",
  "derisory",
  "hail",
  "approbative",
  "reproach",
  "slight",
  "pejorative",
  "kudos",
  "venerate",
  "belittle",
  "commend",
  "revere",
  "phlegmatic",
  "indolence",
  "vivacious",
  "alacrity",
  "torpid",
  "ebullient",
  "exuberant",
  "industrious",
  "lackadaisical",
  "feckless",
  "bustle",
  "dispatch",
  "celerity",
  "palindrome",
  "portmanteau",
  "brunch",
  "neologism",
  "archaic",
  "barbarism",
  "tautology",
  "eponymous",
  "bombastic",
  "cryptic",
  "turgid",
  "lucid",
  "oblique",
  "sesquipedalian",
  "pedantic",
  "erudite",
  "pedagogue",
  "unlettered",
  "benighted",
  "collegial",
  "eminent",
  "churlish",
  "indiscreet",
  "idiosyncrasy",
  "etiquette",
  "brusque",
  "irascible",
  "impolitic",
  "inscrutable",
  "esoteric",
  "currency",
  "abstruse",
  "pellucid",
  "recondite",
  "arcane",
  "philistine",
  "ignoble",
  "base",
  "contemptible",
  "vulgar",
  "wayward",
  "uncultivated",
  "crescendo",
  "coda",
  "mellifluous",
  "forte",
  "amplify",
  "virtuoso",
  "dogged",
  "mulish",
  "badger",
  "ape",
  "crow",
  "slothful",
  "waspish",
  "bovine",
  "vulpine",
  "elephantine",
  "simian",
  "apian",
  "avian",
  "asinine",
  "apostate",
  "sanctimonious",
  "iconoclast",
  "agnostic",
  "sacrilege",
  "inviolate",
  "catholic",
  "novitiate",
  "hagiography",
  "syncretic",
  "desecrate",
  "ecclesiastical",
  "priggish",
  "anathema",
  "ecunemical",
  "extenuate",
  "exonerate",
  "execrate",
  "expurgate",
  "exude",
  "expunge",
  "flout",
  "flaunt",
  "discrete",
  "discreet",
  "affect",
  "effect",
  "venal",
  "venial",
  "complacent",
  "complaisant",
  "emigrate",
  "immigrate",
  "allude",
  "elude",
  "censor",
  "censure",
  "elicit",
  "illicit",
  "flounder",
  "founder",
  "prescribe",
  "proscribe",
  "torturous",
  "tortuous",
  "irksome",
  "ingratiate",
  "cloying",
  "aggravate",
  "vex",
  "gall",
  "mawkish",
  "libel",
  "besmirch",
  "raillery",
  "Scurrilous",
  "calumny",
  "villify",
  "impugn",
  "traduce",
  "verdict",
  "tort",
  "litigious",
  "acquit",
  "subpoena",
  "affidavit",
  "exculpate",
  "appease",
  "implacable",
  "contentious",
  "pugnacious",
  "conciliatory",
  "truculent",
  "jingoist",
  "propitiate",
  "apprehension",
  "petrified",
  "macabre",
  "grisly",
  "morbid",
  "phantasmagorical",
  "horripilation",
  "ostracize",
  "hierarchy",
  "schism",
  "banish",
  "clique",
  "coterie",
  "interdepedence",
  "synergy",
  "benefience",
  "oppresive",
  "despot",
  "autocratic",
  "subjugate",
  "tyrant",
  "behemoth",
  "diminutive",
  "prodigious",
  "immense",
  "gargantuan",
  "colossal",
  "lilliputian",
  "travail",
  "arduous",
  "tumultuous",
  "turbulent",
  "tribulation",
  "vicissitude",
  "quibble",
  "cursory",
  "fastidious",
  "scrutinize",
  "slipshod",
  "meticulous",
  "persnickety",
  "perfunctory",
  "juvenile",
  "senile",
  "embryonic",
  "geriatric",
  "fledgling",
  "callow",
  "moribund",
  "chrysalis",
  "concede",
  "maintain",
  "parry",
  "forensics",
  "riposte",
  "unassailable",
  "affable",
  "inebriated",
  "retiring",
  "extrovert",
  "introvert",
  "debauchery",
  "expansive",
  "verdant",
  "rustic",
  "bucolic",
  "inhospitable",
  "lush",
  "barren",
  "pastoral",
  "idyllic",
  "chronic",
  "perennial",
  "ephemeral",
  "transient",
  "perpetual",
  "interminable",
  "immemorial",
  "evanescent",
  "intermittent",
  "incessant",
  "sporadic",
  "erratic",
  "fitful",
  "desultory",
  "horology",
  "turmoil",
  "upheaval",
  "junta",
  "concord",
  "cataclysmic",
  "usurp",
  "stasis",
  "flag",
  "beam",
  "hamper",
  "minute",
  "graze",
  "refuse",
  "appropriate",
  "graft",
  "harbor",
  "tender",
  "score",
  "weather",
  "wax",
  "temper",
  "table",
  "patent",
  "refrain",
  "fleece",
  "grouse",
  "telling",
  "list",
  "becoming",
  "intimate",
  "entrance",
  "start",
  "check",
  "flush",
  "involved",
  "qualify",
  "fell",
  "arch",
  "exhilirated",
  "blithe",
  "ambivalent",
  "elated",
  "melancholic",
  "dour",
  "morose",
  "saturnine",
  "fortnight",
  "bimonthly",
  "semimonthly",
  "antediluvian",
  "fin-de-si\u00e8cle",
  "crepusular",
  "insipid",
  "vapid",
  "succulent",
  "briny",
  "acrid",
  "toothsome",
  "palatable",
  "ennui",
  "stultifying",
  "effervescent",
  "diversion",
  "buoyant",
  "avocation",
  "insufferable",
  "unconscionable",
  "impertinent",
  "immaterial",
  "inflammable",
  "unnerve",
  "cogent",
  "buttress",
  "garish",
  "hapless",
  "panache",
  "protean",
  "fatuous",
  "cerulean",
  "chartreuse",
  "mauve",
  "azure",
  "alabaster",
  "taupe",
  "puce",
  "maroon",
  "flamboyant",
  "blackball",
  "blue",
  "outlandish",
  "ruddy",
  "purple",
  "cynosure",
  "frugal",
  "magnanimous",
  "munificient",
  "miserly",
  "parsimonious",
  "largesse",
  "economical",
  "hedonist",
  "prodigal",
  "sybarite",
  "spendthrift",
  "profligate",
  "epicurean",
  "hamstring",
  "aquiline",
  "sanguine",
  "choleric",
  "bilious",
  "sartorial",
  "narcissist",
  "herculean",
  "chimera",
  "elysian",
  "apollonian",
  "dionysian",
  "cherub",
  "sublime",
  "cosmogony",
  "ethereal",
  "seraphic",
  "theodicy",
  "empyrean",
  "numinous",
  "cleave",
  "sanction",
  "buckle",
  "re-sign",
  "resign",
  "na\u00efve",
  "ingenuous",
  "subterfuge",
  "conniving",
  "disingenuous",
  "duplicity",
  "mendacious",
  "legerdemain",
  "savant",
  "neophyte",
  "polymath",
  "novice",
  "maven",
  "greenhorn",
  "sagacious",
  "tyro",
  "destitute",
  "affluent",
  "cupidity",
  "lavish",
  "opulent",
  "avarice",
  "penurious",
  "impecunious",
  "muckraker",
  "incumbent",
  "gerrymander",
  "canvass",
  "inaugurate",
  "barnstorm",
  "mudslinging",
  "interregnum",
  "partisan",
  "filibuster",
  "demagogue",
  "lame duck",
  "politico",
  "apparatchik",
  "plenary",
  "insurrection",
  "quell",
  "foment",
  "insurgency",
  "agitate",
  "seditious",
  "subversive",
  "advent",
  "scapegoat",
  "epiphany",
  "idolatry",
  "atonement",
  "pestilence",
  "leviathan",
  "chortle",
  "irreverent",
  "sardonic",
  "parody",
  "guffaw",
  "wry",
  "uproarious",
  "flippant",
  "grave",
  "lament",
  "decorum",
  "dirge",
  "propriety",
  "disconsolate",
  "elegiac",
  "obscure",
  "illustrious",
  "nonentity",
  "notoreity",
  "fanfare",
  "snub",
  "cipher",
  "irresolute",
  "obdurate",
  "acquiesce",
  "insubordinate",
  "impressoniable",
  "amenable",
  "pliant",
  "intransigent",
  "ruthless",
  "scrupulous",
  "nefarious",
  "irreproachable",
  "incorruptible",
  "diabolical",
  "turpitude",
  "kowtow",
  "imperious",
  "supercilious",
  "deferential",
  "impudent",
  "haughty",
  "peremptory",
  "nonplussed",
  "contrite",
  "histrionic",
  "confound",
  "ponderous",
  "chutzpah",
  "klutz",
  "nebbish",
  "schmaltzy",
  "kibitz",
  "shtick",
  "kvetch",
  "maelstrom",
  "bazaar",
  "clairvoyant",
  "saga",
  "berserk",
  "mecca",
  "hegira",
  "mediocre",
  "cardinal",
  "penultimate",
  "abysmal",
  "mundane",
  "nonpareil",
  "catalyst",
  "fulcrum",
  "entropy",
  "hypothesize",
  "empirical",
  "centripetal",
  "irrefutable",
  "pervasive",
  "ubiquitous",
  "ascendant",
  "predominance",
  "sparse",
  "rampant",
  "rife",
  "diminish",
  "petulant",
  "peevish",
  "entreat",
  "supplicate",
  "remonstrate",
  "gainsay",
  "adjure",
  "thwart",
  "galvanize",
  "stymie",
  "inexorable",
  "tonic",
  "indomitable",
  "armistice",
  "entente",
  "cede",
  "accord",
  "annex",
  "maraud",
  "martial",
  "revanchism",
  "cordial",
  "aloof",
  "misanthrope",
  "congenial",
  "amiable",
  "abominable",
  "odious",
  "curmudgeon",
  "lambaste",
  "acrimonious",
  "excorciate",
  "invidious",
  "aspersion",
  "rail",
  "inveigh",
  "vituperative",
  "immaculate",
  "defile",
  "adulterate",
  "degrade",
  "sully",
  "unblemished",
  "vitiate",
  "dictum",
  "platitude",
  "aphorism",
  "clich\u00e9",
  "maxim",
  "precept",
  "bromide",
  "abate",
  "exacerbate",
  "truncate",
  "escalate",
  "curtail",
  "assuage",
  "augment",
  "cessation",
  "self-aggrandizing",
  "self-deprecating",
  "altruistic",
  "modest",
  "selfless",
  "egotistical",
  "self-effacing",
  "self-abnegation",
  "eke",
  "mar",
  "imp",
  "ire",
  "vie",
  "woe",
  "nub",
  "char",
  "pith",
  "carp",
  "moil",
  "foil",
  "curt",
  "deft",
  "crux",
  "indefatigable",
  "infinitesimal",
  "commensurate",
  "disenchantment",
  "prognostication",
  "indemnification",
  "unprepossessing",
  "pulchritudinous",
  "cumbersome",
  "palpable",
  "gossamer",
  "indiscernible",
  "insubstantial",
  "intangible",
  "translucent",
  "fracas",
  "furor",
  "d\u00e9tente",
  "hullabaloo",
  "ado",
  "fiasco",
  "reconciliation",
  "rift",
  "derivative",
  "orthodox",
  "pedestrian",
  "banal",
  "hackneyed",
  "trite",
  "prosaic",
  "quotidian",
  "pioneering",
  "avant-garde",
  "maverick",
  "visionary",
  "unconventional",
  "radical",
  "nudge",
  "coerce",
  "duress",
  "coax",
  "goad",
  "induce",
  "cajole",
  "blandishment",
  "perplexed",
  "equanimity",
  "imperturbable",
  "poised",
  "flummox",
  "discombobulated",
  "aplomb",
  "baffle",
  "speculation",
  "conjecture",
  "presumption",
  "aver",
  "submit",
  "postulate",
  "posit",
  "innocuous",
  "insidious",
  "salubrious",
  "revitalize",
  "pernicious",
  "restorative",
  "deleterious",
  "indignant",
  "bristle",
  "disgruntled",
  "incensed",
  "peeve",
  "piqued",
  "irate",
  "wrath",
  "intrepid",
  "formidable",
  "undaunted",
  "plucky",
  "valorous",
  "pusillanimous",
  "redoubtable",
  "edict",
  "abrogate",
  "promulgate",
  "enact",
  "annul",
  "fiat",
  "rescind",
  "obtuse",
  "niche",
  "astute",
  "acumen",
  "shrewd",
  "acute",
  "bailiwick",
  "benign",
  "benefactor",
  "benediction",
  "beneficial",
  "benevolence",
  "befeficiary",
  "malaria",
  "malfeasance",
  "malapropism",
  "malodorous",
  "malady",
  "malice",
  "malign",
  "maleficent",
  "telephone",
  "phonetic",
  "cacophony",
  "symphony",
  "homophone",
  "francophone",
  "anglophone",
  "phoneme",
  "euphoria",
  "euphemism",
  "eugenics",
  "euthanasia",
  "eulogy",
  "eureka",
  "euphony",
  "eudaemonic",
  "anthropology",
  "anthropocentric",
  "anthropomorphic",
  "anthropogenic",
  "anthropophagy",
  "anthropocene",
  "circumspect",
  "circumvent",
  "circumscribe",
  "circumlocution",
  "circumstance",
  "circumambulate",
  "circumference",
  "bureaucracy",
  "autocracy",
  "plutocracy",
  "democracy",
  "aristocracy",
  "theocracy",
  "techonacracy",
  "gerontocracy",
  "dichotomy",
  "dilate",
  "diurnal",
  "diverse",
  "diverge",
  "dissect",
  "dilute",
  "diameter",
  "diagnosis",
  "dialogue",
  "diorama",
  "diadem",
  "diachronic",
  "diapason",
  "epidemic",
  "epitome",
  "epistolary",
  "epitaph",
  "epithet",
  "epigram",
  "epigraph",
  "extant",
  "exquisite",
  "excommunicate",
  "exert",
  "exempt",
  "exact",
  "excruciating",
  "exemplar",
  "exhume",
  "exorcise",
  "expatriate",
  "expedient",
  "expeditious",
  "expend",
  "explicate",
  "exploit",
  "expos\u00e9",
  "extemporaneous",
  "expostulate",
  "extort",
  "extradite",
  "expository",
  "exult",
  "extricate",
  "imbibe",
  "impeach",
  "immerse",
  "impair",
  "impart",
  "imbue",
  "impel",
  "impenetrable",
  "implausible",
  "implore",
  "imponderable",
  "impoverished",
  "impuissant",
  "inadvertent",
  "inculcate",
  "inamorata",
  "inane",
  "inapt",
  "incandescent",
  "inadmissible",
  "incarcerate",
  "inclement",
  "incipient",
  "incentivize",
  "inception",
  "incinerate",
  "incite",
  "incongruous",
  "inconsolable",
  "incorrigible",
  "incredulous",
  "indiscriminate",
  "incontrovertible",
  "indulgent",
  "ineffable",
  "indoctrinate",
  "infectious",
  "inter",
  "inequity",
  "inimical",
  "iniquity",
  "insinuate",
  "incapacitate",
  "innumerable",
  "instigate",
  "intersperse",
  "interrogate",
  "intercede",
  "interdict",
  "interim",
  "interject",
  "intermediary",
  "interloper",
  "interlocutor",
  "intermission",
  "interplay",
  "internecine",
  "subservient",
  "submerge",
  "subsume",
  "subterranean",
  "subsidize",
  "substantiate",
  "empathy",
  "apathy",
  "antipathy",
  "sociopath",
  "pathogen",
  "pathos",
  "pathological",
  "homeopathic",
  "refractory",
  "fractious",
  "fragment",
  "fragile",
  "fracture",
  "fractal",
  "belligerent",
  "bellow",
  "bellicose",
  "belle",
  "antebellum",
  "casus belli",
  "carnal",
  "carnage",
  "carnivore",
  "carnelian",
  "carnation",
  "carnival",
  "cognitive",
  "reconnaissance",
  "incognito",
  "recognize",
  "cognizant",
  "precognition",
  "reconnoiter",
  "minimalism",
  "miniscule",
  "minutiae",
  "diminish",
  "minute",
  "diminution",
  "minatory",
  "apocalypse",
  "apostle",
  "apogee",
  "apothecary",
  "apoplectic",
  "apologist",
  "apothegm",
  "apotheosis",
  "omit",
  "emit",
  "manumit",
  "unremitting",
  "noncommital",
  "transmit",
  "panacea",
  "pandemonium",
  "panegyric",
  "pantomime",
  "pantheist",
  "pandemic",
  "panoply",
  "panopticon",
  "paradox",
  "paradigm",
  "paroxysm",
  "paragon",
  "parabola",
  "paralegal",
  "paramount",
  "parapet",
  "peripheral",
  "peripatetic",
  "perigee",
  "periscope",
  "periodontal",
  "perihelion",
  "periphrastic",
  "ascribe",
  "nondescript",
  "inscribe",
  "subscribe",
  "scribe",
  "conscript",
  "descry",
  "transcribe",
  "transcend",
  "transgress",
  "transverse",
  "transpose",
  "transmogrify",
  "proponent",
  "protracted",
  "procrastinate",
  "protuberance",
  "propogate",
  "provenance",
  "providential",
  "prolix",
  "compunction",
  "poignant",
  "punctilio",
  "acupuncture",
  "punctuate",
  "disreputable",
  "impute",
  "putative",
  "dispute",
  "undisputed",
  "deputy",
  "requisite",
  "perquisite",
  "prerequisite",
  "requisition",
  "inquisition",
  "acquisition",
  "arrogate",
  "surrogate",
  "prerogative",
  "arrogant",
  "roguish",
  "derogate",
  "supererogotary",
  "subsequent",
  "segue",
  "obsequious",
  "inconsequential",
  "sequester",
  "obsequies",
  "eccentric",
  "anecdote",
  "eclectic",
  "ecstatic",
  "appendectomy",
  "synecdoche",
  "abet",
  "ameliorate",
  "aficionado",
  "abut",
  "abridge",
  "awry",
  "acolyte",
  "amnesia",
  "amorphous",
  "anomolous",
  "atypical",
  "amnesty",
  "athiest",
  "atrophy",
  "aphasia",
  "resuscicate",
  "cite",
  "solicitous",
  "recitation",
  "unsolicited",
  "convivial",
  "confluence",
  "conflate",
  "condolence",
  "convoke",
  "conclave",
  "consanguinity",
  "condone",
  "connote",
  "conjugal",
  "congeal",
  "concentric",
  "contiguous",
  "contumacious",
  "delineate",
  "devolve",
  "denude",
  "descend",
  "delimit",
  "debunk",
  "defenestrate",
  "decadent",
  "detritus",
  "denouement",
  "envisage",
  "entice",
  "enjoin",
  "entourage",
  "ensue",
  "encroach",
  "ensconce",
  "endorse",
  "engorge",
  "enclave",
  "encompass",
  "unencumbered",
  "enthrall",
  "encomium",
  "enormity",
  "ineluctable",
  "evocative",
  "enunciate",
  "elocution",
  "emolument",
  "factoid",
  "factotum",
  "olfactory",
  "artifact",
  "putrefaction",
  "factious",
  "factitious",
  "prolific",
  "ramification",
  "pontificate",
  "fortification",
  "edifice",
  "ratification",
  "edification",
  "progeny",
  "indigenous",
  "carcinogenic",
  "gensis",
  "genealogy",
  "genocide",
  "endogenous",
  "regress",
  "digress",
  "progressive",
  "congress",
  "ingress",
  "egress",
  "calligraphy",
  "topography",
  "demographics",
  "graphite",
  "cartography",
  "bibliography",
  "choreography",
  "graphologist",
  "ambiguous",
  "mitigate",
  "castigate",
  "navigate",
  "exigent",
  "unmitigated",
  "appendix",
  "compendious",
  "impending",
  "appendage",
  "pending",
  "expenditure",
  "regicide",
  "regalia",
  "regal",
  "regent",
  "regiment",
  "regnant",
  "ascertain",
  "antiquated",
  "accretion",
  "adulate",
  "admonish",
  "banter",
  "bedlam",
  "belie",
  "bemoan",
  "beguile",
  "berate",
  "betrothed",
  "caustic",
  "collude",
  "cantankerous",
  "clamber",
  "catatonic",
  "carouse",
  "commiserate",
  "divulge",
  "deign",
  "disdain",
  "demonstrative",
  "delirious",
  "dismay",
  "dilapidated",
  "disparage",
  "eschew",
  "eradicate",
  "elegant",
  "entertain",
  "evident",
  "espouse",
  "endow",
  "finagle",
  "foist",
  "festoon",
  "fritter",
  "feral",
  "filigree",
  "fickle",
  "germane",
  "garner",
  "gentrification",
  "gripe",
  "glom",
  "glum",
  "grovel",
  "heretic",
  "hegemony",
  "husbandry",
  "haven",
  "hallow",
  "hirsute",
  "harry",
  "inveterate",
  "inoculate",
  "impervious",
  "itinenary",
  "idiom",
  "intuitive",
  "imprint",
  "impetus",
  "lithe",
  "livid",
  "languorous",
  "leery",
  "lull",
  "liable",
  "lumber",
  "mirth",
  "mettle",
  "myopic",
  "maim",
  "meager",
  "meander",
  "mull",
  "negligible",
  "nadir",
  "noisome",
  "nimble",
  "nary",
  "natter",
  "natty",
  "ominious",
  "omnipotent",
  "ossify",
  "opine",
  "oeuvre",
  "ornery",
  "onerous",
  "perpetuate",
  "prevaricate",
  "penchant",
  "peddle",
  "pander",
  "preempt",
  "pilfer",
  "quagmire",
  "quixotic",
  "quisling",
  "quip",
  "quandary",
  "quizzical",
  "querulous",
  "refine",
  "relinquish",
  "ramshackle",
  "revert",
  "resilient",
  "retribution",
  "stringent",
  "soporific",
  "spurious",
  "sequential",
  "stark",
  "spurn",
  "specious",
  "tantamount",
  "taut",
  "travesty",
  "triage",
  "tempest",
  "titillate",
  "unanimous",
  "undulate",
  "unctuous",
  "unassuming",
  "usher",
  "utilitarian",
  "ululate",
  "vacuous",
  "vaunt",
  "vehement",
  "valiant",
  "vouch",
  "vernacular",
  "vignette"
]