[
  {
    "term": "256",
    "explanations": [
      "This is 2 to the 8th power. It is the number of different numbers that you can store in a byte (8 bits), usually ranging from 0 to 255. An 8-bit number can be represented by two hexadecimal digits or three octal digits. (see ASCII)"
    ]
  },
  {
    "term": "AI",
    "explanations": ["Artificial Intelligence."]
  },
  {
    "term": "ASCII",
    "explanations": [
      "Pronounced ass-key. Stands for the American Standard Code for Information Interchange. It is a 7-bit code for characters. For example: the letter 'x' is represented as 1111000. Because it is only 7 bits long, an ASCII character can be stored in a byte."
    ]
  },
  {
    "term": "Abstraction",
    "explanations": [
      "Removing detail of something to focus on a subset of the features without confusing details."
    ]
  },
  {
    "term": "Address",
    "explanations": [
      "a) A location in memory or identifying a particular piece of memory.",
      "b) An identification that allows access to something such as an internet address which allows one to access a device on the internet."
    ]
  },
  {
    "term": "Agent-Based Modeling",
    "explanations": [
      "A method of simulating the real world in which individual agents interact with their environment and each other to simulate real-world behaviors and conditions. NetLogo is good at Agent-Based Modeling."
    ]
  },
  {
    "term": "Agent",
    "explanations": [
      "Independent acting sections of code and data that represent active interacting pieces of a model or system."
    ]
  },
  {
    "term": "Algorithm",
    "explanations": [
      "A set of instructions for accomplishing a task that when executed will terminate."
    ]
  },
  {
    "term": "Analog",
    "explanations": [
      "Measured in continuous values. The audio signal from a microphone is analog. A clock with hands is considered analog."
    ]
  },
  {
    "term": "Application",
    "explanations": ["A runnable program that provides some service."]
  },
  {
    "term": "Argument",
    "explanations": [
      "One of the pieces of data provided as input to a procedure or function through the call to the procedure or function."
    ]
  },
  {
    "term": "Artificial Intelligence",
    "explanations": [
      "The subfield of computer science that involves the creation of programs that attempt to do what was formerly believed to only be able to be done by humans."
    ]
  },
  {
    "term": "Assignment",
    "explanations": [
      "This stores a value in a variable. An assignment statement has an assignment in it describing the storage of values in variables."
    ]
  },
  {
    "term": "Autonomous",
    "explanations": ["Controlled by computer programs and not people."]
  },
  {
    "term": "Bandwidth",
    "explanations": [
      "Refers to the volume of information that can be transmitted or processed. It is usually measured in bits or bytes per time unit like 'bits per second'."
    ]
  },
  {
    "term": "Big Data",
    "explanations": [
      "The problem beginning in the 21st century of processing vast amounts of data coming at or refreshing at very high speed. For example satellite sensor data, city monitoring sensors, gene sequencing data, etc."
    ]
  },

  {
    "term": "Binary",
    "explanations": [
      "The base 2 number system. Integer can be encoded as binary which is a string of 0's and 1's. Binary is a place-value system in which each bit position denotes a power of 2 (unlike decimal which uses 10 symbols and powers of 10). k bits of information can represent 2k different numbers. For example, counting in 3 bits of binary you can count from 0 to 7: 000, 001, 010, 011, 100, 101, 110, 111."
    ]
  },
  {
    "term": "Bit",
    "explanations": [
      "A binary digit. The smallest unit of information is represented by one of two states (usually 0 or 1). It is often denoted by a lowercase 'b' as in Mbs (megabits per second). Or the amount of information gained when answering a yes or no question."
    ]
  },
  {
    "term": "Block",
    "explanations": [
      "A collection of statements that can be grouped to be treated as one statement. For instance in Cand Processing statements inside parentheses are treated as one statement that is either executed together or not. Generally, the only 'entry' into a block of code is at the top of the code."
    ]
  },
  {
    "term": "Boolean",
    "explanations": [
      "A type in many programming languages that can hold either a True or a False. The name comes from the mathematician George Boole. It can also refer to the type of expression for example the type of the expression> 6 is Boolean."
    ]
  },
  {
    "term": "Boot Program",
    "explanations": [
      "The program runs when the computer hardware is powered up."
    ]
  },
  {
    "term": "Boot",
    "explanations": [
      "To restart a computer as if the computer had been powered down regardless of whether it was on and running or not."
    ]
  },
  {
    "term": "Broadcast",
    "explanations": [
      "In messaging passing it is to send the same message to all who can listen as opposed to peer-to-peer communication for instance."
    ]
  },
  {
    "term": "Bus",
    "explanations": [
      "a) the main path for bits traveling in parallel in and out of a CPU or between major computational, storage, and device components. It is often many bits wide.",
      "b) Any pathway for bits to travel in parallel."
    ]
  },
  {
    "term": "Byte",
    "explanations": [
      "8 bits. It is often denoted by a capital B as in MB (megabytes)."
    ]
  },
  {
    "term": "Call",
    "explanations": [
      "A statement in a language that starts or invokes a procedure or function."
    ]
  },
  {
    "term": "CPU",
    "explanations": [
      "Central Processing Unit. Where the computer instructions are executed. It usually refers to the general-purpose processor that handles a range of processing tasks."
    ]
  },
  {
    "term": "CPU intensive",
    "explanations": [
      "A program that spends most of its time running on the CPU with a disproportionately small amount of time waiting for data from memory."
    ]
  },
  {
    "term": "Cache",
    "explanations": [
      "Is memory used to speed memory access, that stores data that is anticipated to be used next or was just used and may be used again? For example, cache may exist on slow physically rotating discs to save information of data that is near to the data just accessed or to hold data without writing it to disc until it is likely not to change again."
    ]
  },
  {
    "term": "Card",
    "explanations": [
      "A circuit board which can be plugged into your computer motherboard."
    ]
  },
  {
    "term": "Central Processing Unit",
    "explanations": [
      "Processing unit that takes streams of bits as data and instructions and executes the instructions on the data yielding more data and possibly instructions."
    ]
  },
  {
    "term": "Character",
    "explanations": [
      "A single letter or symbol that is represented by a small set of bytes in the computer. See ASCII and Unicode."
    ]
  },
  {
    "term": "Chip",
    "explanations": [
      "An integrated electronic circuit generally with from thousands to billions of components such as transistors and capacitors that perform complex functionality such as addressable memory, CPU, I/O functions."
    ]
  },
  {
    "term": "Clock",
    "explanations": [
      "The internal 'drummer' or heartbeat that keeps the CPU activities across the chip and the motherboard in sync. Often measured in megahertz or gigahertz."
    ]
  },
  {
    "term": "Cloud",
    "explanations": [
      "a) the phrase 'in the cloud' refers to information being stored not on one's computer but on a distant mass storage device accessible via the internet.",
      "b) Computing that is done not on one's computer but on computers accessed via the internet. "
    ]
  },
  {
    "term": "Comment",
    "explanations": [
      "Comments are important in programs as they are nonexecuting code that explains to a reader of the code in plain text what is going on."
    ]
  },
  {
    "term": "Comparison",
    "explanations": [
      "This is an operation that compares things like if the values in two variables are equal. In processing the equals comparison is done with the double equals: ==. In NetLogo it is done with a single equals: =. Other comparisons are things like not equal and greater than."
    ]
  },
  {
    "term": "Compiler",
    "explanations": [
      "A program for translating a program written in one language into code that can be executed. "
    ]
  },
  {
    "term": "Computer",
    "explanations": [
      "An electronic device for storing and processing information based on programs stored in the computer."
    ]
  },
  {
    "term": "Conditional",
    "explanations": [
      "A control structure such as an if-statement or case-statement that conditionally executes a block of code."
    ]
  },
  {
    "term": "Core",
    "explanations": [
      "A sub-processor on a chip. Usually used when there is more than one processor on a single chip. Modern CPU chips often have several cores."
    ]
  },
  {
    "term": "Database",
    "explanations": [
      "An organized collection of data and services to access them in a variety of ways relevant to the data."
    ]
  },
  {
    "term": "Declaration",
    "explanations": [
      "A statement in a program that attaches a property to a symbol. For example, in Processing you might say: 'float x' which means that the variable x has the property that it is a floating point number. In processing have to declare variables giving them a type before you use them."
    ]
  },
  {
    "term": "Device",
    "explanations": [
      "A unit or piece of hardware with a specific purpose such as a disk, keyboard, audio board, etc."
    ]
  },
  {
    "term": "Digital",
    "explanations": [
      "Measured in a set of discrete steps. The audio signal on a CD or in an mp4 file is digital. cf. Analog."
    ]
  },
  {
    "term": "Disk",
    "explanations": [
      "A magnetic storage device that records data on a spinning disk. The bulk of long-term storage on a computer is 'on the disk'. The main file system is usually found here. Compared with the term SSD"
    ]
  },
  {
    "term": "Drone",
    "explanations": [
      "An unmanned flying vehicle (See UAV). May be remote controlled or autonomous."
    ]
  },
  {
    "term": "Embedded",
    "explanations": [
      "A computer is said to be embedded if it is integrated into the function of a physical item. The computers in a car are embedded in the car. One speaks of embedded systems."
    ]
  },
  {
    "term": "Emacs",
    "explanations": [
      "A classic highly reconfigurable editor that challenges vi for dominance of UNIX-based text editing."
    ]
  },
  {
    "term": "Encryption",
    "explanations": [
      "To use a code to render data unintelligible. An encryption key is data that when supplied to an encryption program and the original data to be encrypted yields the encrypted data. A decryption key when supplied with a decryption program and encrypted data recovers the original data. Many times these two keys are the same."
    ]
  },
  {
    "term": "Executable",
    "explanations": ["A file that can be executed by the operating system."]
  },
  {
    "term": "Expression",
    "explanations": [
      "Is a language construct that can be used to produce a value. For example sqrt(3) or 4+7*88."
    ]
  },
  {
    "term": "File",
    "explanations": [
      "a single block of information allocated by an operating system for retention beyond the execution time of any program."
    ]
  },
  {
    "term": "Function",
    "explanations": [
      "A standalone segment of code with a clear set of inputs and output that performs a specific function and returns a value. It is essentially a procedure that returns a value."
    ]
  },
  {
    "term": "GPU",
    "explanations": [
      "Graphics Processing Unit. It is a CPU that processes instructions specifically targeted at graphics processing. It is highly parallel with hundreds to thousands of simple cores."
    ]
  },
  {
    "term": "Grammar",
    "explanations": ["The formal specification of the syntax of a language."]
  },
  {
    "term": "HTML",
    "explanations": [
      "Hypertext Markup Language. A language used to write internet-based documents that can refer to each other."
    ]
  },
  {
    "term": "HW",
    "explanations": ["abbreviation for hardware."]
  },
  {
    "term": "Hardware",
    "explanations": ["Physical components of a computer or related equipment."]
  },
  {
    "term": "Hertz",
    "explanations": [
      "A cycle or oscillation per second. A second hand on a standard analog clock ticks at 1 hertz. The clock on most computers is currently on the order of 1 gigahertz."
    ]
  },
  {
    "term": "Hexadecimal",
    "explanations": [
      "The base 16 number system (compare with binary). It is often used to express binary numbers in shorter strings than binary or octal. Counting to 20 using two hex symbols: 01, 02, 03, 04, 05, 06, 07, 08, 09,0a, 0b, 0c, 0d, 0e, 0f, 10, 11, 12, 13, 14."
    ]
  },
  {
    "term": "Hex",
    "explanations": ["Short for Hexadecimal."]
  },
  {
    "term": "IDE",
    "explanations": [
      "Integrated Development Environment. A software tool to help you write software. Examples include the open source: Eclipse and NetBeans and the proprietary Microsoft Visual Studio."
    ]
  },
  {
    "term": "Indenting",
    "explanations": [
      "Indenting is a MUST in your program. Indenting shows the reader what is the intended nesting of the code. Indenting is a critical tool in debugging. Always, always indent!!"
    ]
  },
  {
    "term": "Instruction",
    "explanations": [
      "a) A single executable action for the CPU",
      "b) the binary encoded form for the instruction."
    ]
  },
  {
    "term": "Integer",
    "explanations": [
      "A whole number, that is, with no fractional part. Maybe be positive, negative, or zero."
    ]
  },
  {
    "term": "Interface",
    "explanations": [
      "The formal way in which two things interact. In particular how humans and machines interact or two pieces of software interact."
    ]
  },
  {
    "term": "Internet",
    "explanations": [
      "A network of computers, routers, and other networks interconnected with a specific network communications protocol (TCP/IP)."
    ]
  },
  {
    "term": "Interpreter",
    "explanations": [
      "A combination of a compiler and runtime environment that translates and executes a program in one step."
    ]
  },
  {
    "term": "IOT",
    "explanations": [
      "Internet of Things. Physical objects with embedded computers that represent the object on the internet. For example, a washing machine may be on the internet allowing an owner to 'start the wash' remotely. Around 2021 the number of IOT devices exceeded the number of people and continues to grow."
    ]
  },
  {
    "term": "IT",
    "explanations": [
      "Information Technology. This refers to general hardware, OS, and network design and support."
    ]
  },
  {
    "term": "Keyword",
    "explanations": [
      "A reserved word in the language that has special meaning in the language and cannot be appropriated for other purposes. For example 'for' in Processing or C++."
    ]
  },
  {
    "term": "Linux",
    "explanations": [
      "An operating system authored by Linus Torvalds as a free operating system. Companies that distribute Linux make their money in configuration and support. It is based on the UNIX operating system."
    ]
  },
  {
    "term": "Loop",
    "explanations": [
      "A control structure in the code that causes repeated execution of a section of code."
    ]
  },
  {
    "term": "Malware",
    "explanations": [
      "Software that is surreptitiously installed on a computer to damage, compromise, or acquire data. It may also be used for unauthorized accessibility to the function of the computer e.g. cause damage to a machine controlled by the computer"
    ]
  },
  {
    "term": "Meerkat",
    "explanations": [
      "A burrowing social mammal of the mongoose family found in southern Africa."
    ]
  },
  {
    "term": "Memory",
    "explanations": [
      "Addressable storage for storage and retrieval of bytes of data. The term memory generally refers to memory that is off the CPU. See the terms Cache and RAM."
    ]
  },
  {
    "term": "Motherboard",
    "explanations": [
      "The main circuit board generally connects most major components of a computer such as CPU, memory, and I/O devices."
    ]
  },
  {
    "term": "Nano",
    "explanations": [
      "a) a prefix for a billionth, as in a nanosecond or a nanometer.",
      "b) a very small thing like nanotechnology."
    ]
  },
  {
    "term": "Nanosecond",
    "explanations": [
      "a billionth of a second. Light travels about a foot in a vacuum in a nanosecond"
    ]
  },
  {
    "term": "Nest",
    "explanations": [
      "Nesting is an important feature of most computer programs and languages. To nest a piece of code in another piece of code is to use the first code as an integral block of function in the second piece of code. For example, we could nest a for statement in the body of another for statement."
    ]
  },
  {
    "term": "NetLogo",
    "explanations": [
      "An easy-to-use agent-based modeling language and development environment based on the classic Logo language"
    ]
  },
  {
    "term": "Network",
    "explanations": [
      "An interconnected set of computers that can share information."
    ]
  },
  {
    "term": "Northbridge",
    "explanations": [
      "connects the CPU to high-speed data components such as memory and graphics cards."
    ]
  },
  {
    "term": "OS",
    "explanations": ["Operating System."]
  },
  {
    "term": "Object",
    "explanations": [
      "A collection of variables and functions brought together in a programming system to represent a physical thing, its data, and its function."
    ]
  },
  {
    "term": "Octal",
    "explanations": [
      "The base 8 number system (compare with binary). It is often used to express binary numbers in shorter strings. Counting to 10 using two octal symbols: 01, 02, 03, 04, 05, 06, 07, 10, 11, 12."
    ]
  },
  {
    "term": "Operator",
    "explanations": [
      "Is a computational or mathematical operator such as ==, equal, *, +, /. It generally is used in between the values to be used as input for the operator (called operands). For example 1+2."
    ]
  },
  {
    "term": "PC",
    "explanations": [
      "Personal Computer sometimes stands for a Personal Computer running the Windows operating system."
    ]
  },
  {
    "term": "Packet",
    "explanations": [
      "A unit of information into which data is broken up for transmission in a network or by other means. For example, a stream or file of data would be broken up into packets and sent separately across the internet."
    ]
  },
  {
    "term": "Parallel",
    "explanations": [
      "processes run in parallel means they are executing at the same time on different CPUs or cores."
    ]
  },
  {
    "term": "Peripheral",
    "explanations": [
      "A physical device used by a computer that is not part of the physical box containing CPU and memory. A printer is an example."
    ]
  },
  {
    "term": "Port",
    "explanations": [
      "A physical socket on a computer for attaching the computer to external devices such as a printer or a router."
    ]
  },
  {
    "term": "Procedure",
    "explanations": [
      "A standalone segment of code with a clear set of inputs and output that performs a specific function. Compare with function."
    ]
  },
  {
    "term": "Process",
    "explanations": ["An operating system construct that is a running program."]
  },
  {
    "term": "Processing",
    "explanations": [
      "A language originally designed for artists to allow them to do simple graphical design programs in an amovie-like paradigm."
    ]
  },
  {
    "term": "Programming",
    "explanations": [
      "Constructing a program; usually in a high-level language. The art of instructing computers how to store, retrieve, and process data automatically."
    ]
  },
  {
    "term": "Program",
    "explanations": ["An implementation of an algorithm."]
  },
  {
    "term": "Proprietary",
    "explanations": [
      "Owned by an individual or company and whose use generally requires payment."
    ]
  },
  {
    "term": "Protocol",
    "explanations": [
      "A standard for communication between pieces of hardware or between pieces of software that allows information and/or commands to be exchanged."
    ]
  },
  {
    "term": "RAM",
    "explanations": [
      "Random Access Memory. Generally refers to the memory that is not in the CPU and not a disk. In general, it is volatile and anything in it is lost when the computer is turned off. It's used to temporarily store current instructions and data during execution amongst other things."
    ]
  },
  {
    "term": "Ransomware",
    "explanations": [
      "Malicious software designed to hold data hostage for money often by encrypting it."
    ]
  },
  {
    "term": "RGB",
    "explanations": [
      "Stands for 'Red, Green, Blue'. It is a way of specifying a color by giving the amount of each of three contributing primary colors to make the desired color."
    ]
  },
  {
    "term": "Reboot",
    "explanations": [
      "To restart a computer as if the computer had been powered down even though it was turned on and possibly running."
    ]
  },
  {
    "term": "Recursion",
    "explanations": [
      "The programming or algorithm technique of invoking a procedure from within itself. See Recursion."
    ]
  },
  {
    "term": "Router",
    "explanations": [
      "A networking device that forwards data packets between computer networks and may also be used to connect computers to a network."
    ]
  },
  {
    "term": "Shell",
    "explanations": [
      "A character-based program that gives the user simple and programmatic access to the operating system via commands"
    ]
  },
  {
    "term": "STEM",
    "explanations": [
      "Science Technology Engineering and Mathematics - The set of fields many educational institutions and governments are focusing on to improve enrollments and retention."
    ]
  },
  {
    "term": "SW",
    "explanations": ["abbreviation for software."]
  },
  {
    "term": "Scratch",
    "explanations": [
      "A language created by MIT containing colorful characters and easy for beginners to write programs without syntax errors"
    ]
  },
  {
    "term": "Semantics",
    "explanations": [
      "The meaning of statements in a language as distinct from the syntax."
    ]
  },
  {
    "term": "Server",
    "explanations": [
      "A computer that provides some service and is accessible over the internet."
    ]
  },
  {
    "term": "Simulation",
    "explanations": ["Modeling the behaviors and conditions of the real world."]
  },
  {
    "term": "SoC",
    "explanations": [
      "System on a chip. A single integrated circuit that integrates all or most components of a computer including CPU, memory, I/O, and bus. May include devices such as wireless modems. Contrast with motherboard-based PC architectures. Examples of SoCs include Apple M1, Snapdragon, and ARMxxx chips."
    ]
  },
  {
    "term": "Software",
    "explanations": [
      "A set of information that includes at least one program and optionally many programs and data files. The set of information is generally related and used with a specific goal in mind such as image processing software."
    ]
  },
  {
    "term": "Southbridge",
    "explanations": [
      "connects the CPU to lower speed data components such as internet, keyboard, audio, USB, etc."
    ]
  },
  {
    "term": "Statement",
    "explanations": [
      "A basic statement or command in the program or the basic unit of a grammar of a programming language. For instance: the three assignment statements were followed by an if statement."
    ]
  },
  {
    "term": "String",
    "explanations": [
      "a) An ordered sequence such as a string of bits or characters.",
      "b) a string of characters."
    ]
  },
  {
    "term": "Supercomputer",
    "explanations": ["A computer with a much higher than average performance."]
  },
  {
    "term": "Syntax",
    "explanations": [
      "The grammar for a language or the rules to decide if a statement is in the language but not the meaning."
    ]
  },
  {
    "term": "Telepresence",
    "explanations": [
      "A set of technologies which allows a person to feel as if they were present, to give the appearance of being present, and/or to have an effect as if present."
    ]
  },
  {
    "term": "Text",
    "explanations": [
      "a) just the set of bits that represents a stream of symbols in a language. It does not include any information such as font or color.",
      "b) any representation of a set of symbols.",
      "c) text encoded in ASCII."
    ]
  },
  {
    "term": "Thread",
    "explanations": [
      "A thread is a 'lightweight' subunit of execution of a process that can run in parallel with other threads in the process. It is a way to have parts of a process run simultaneously."
    ]
  },
  {
    "term": "Tractable",
    "explanations": ["Solvable in a practical amount of time."]
  },
  {
    "term": "Type",
    "explanations": [
      "The kind of data that can be stored or referred to and has a specific set of operations that apply to it such as addition is an operation that is used on integers. Popular types are int, float, and boolean. Processing supports types like color and string as well."
    ]
  },
  {
    "term": "UAV",
    "explanations": ["Unmanned Aerial Vehicle and autonomous drone."]
  },
  {
    "term": "UNIX",
    "explanations": [
      "A variety of operating systems that originated in the 70s as an independent project in Bell Labs and has grown to be the basis of many of today's operating systems including Linux and Apple distributions ."
    ]
  },
  {
    "term": "URL",
    "explanations": [
      "A Uniform Resource Locator or the web address is a reference to a web resource that specifies its location on a computer network and a mechanism for retrieving it such as HTTP or FTP"
    ]
  },
  {
    "term": "Usagi",
    "explanations": ["The Japanese word for rabbit."]
  },
  {
    "term": "USB",
    "explanations": [
      "Universal Serial Bus. A popular standard for creating a data path between computers and peripherals. It includes the capability of powering a device. More recently USB has been used as a power source alone, disregarding its data protocols."
    ]
  },
  {
    "term": "Unicode",
    "explanations": [
      "A method for encoding a string of symbols as bits. This set of schemes can be used to represent nearly any symbol including Chinese."
    ]
  },
  {
    "term": "Variable",
    "explanations": [
      "A place in a running program where data is stored. For example, the variable x might contain a number like 42."
    ]
  },
  {
    "term": "Visibility",
    "explanations": [
      "Said of a variable. A variable is visible if its contents can be accessed by its name. A local variable in one function might not be visible from inside another function."
    ]
  },
  {
    "term": "Vi",
    "explanations": [
      "The classic text editor on a UNIX machine. Generally available on all UNIX-based operating systems. The modern version of vi is vim."
    ]
  },
  {
    "term": "Windows",
    "explanations": [
      "The proprietary operating system distributed by Microsoft."
    ]
  },
  {
    "term": "Computer science",
    "explanations": [
      "a) the study of process, data and computation.",
      "b) A very cool profession. (No bias here. ;-) )."
    ]
  },

  {
    "term": "Cloud Computing",
    "explanations": [
      "Rather than computation occurring 'locally' on one's computer, the computation is on distant machines accessible via the internet."
    ]
  },
  {
    "term": "Cloud Storage",
    "explanations": [
      "Rather than the information being stored 'locally' on one's computer, the information is stored on distant machines accessible via the internet."
    ]
  },
  {
    "term": "Cluster Computer",
    "explanations": [
      "Also known as a cluster is a supercomputer made up of many smaller computers such as PCs connected with very fast network hardware."
    ]
  },
  {
    "term": "Compile Time",
    "explanations": ["During the time that a program is being compiled."]
  },
  {
    "term": "Control structure",
    "explanations": [
      "Code or statement that changes the order of execution for instance an if-statement conditionally executes code while a loop may perform a section of code repeatedly."
    ]
  },
  {
    "term": "Customer Base",
    "explanations": [
      "The set of loyal customers a company or other software supplier supports."
    ]
  },
  {
    "term": "Data Abstraction",
    "explanations": [
      "Giving a name to a complex set of data that forms a single concept thereby removing the need to always refer to all the detail.",
      "To hide the details of data by referring to the whole rather than the parts. For example, a complex data structure may be necessary to describe all the details of a car but could collectively be referred to as simply the car type.",
      "All the data of the car could for instance be created, copied, sorted, and deleted without mentioning all the parts."
    ]
  },
  {
    "term": "Data Mining",
    "explanations": [
      "Using algorithms to infer complex results for masses of data such as sensor data or the world's web pages.",
      "Generally, be data mining most of the data available is not relevant but large enough amounts that it is nontrivial to conclude."
    ]
  },
  {
    "term": "Data-intensive",
    "explanations": [
      "A program that spends most of its time waiting for data from memory rather than computing. Sometimes called memory intensive."
    ]
  },
  {
    "term": "Digital Divide",
    "explanations": [
      "The societal advantages for those with internet or computer access over those who do not have access or have limited access"
    ]
  },
  {
    "term": "External hard drive",
    "explanations": ["A disk that is a peripheral."]
  },
  {
    "term": "File Extension",
    "explanations": [
      "When naming a file there is often a part after the last period in the file name called the file extension that indicates the type of the file such as pdf, jpg, txt, etc."
    ]
  },
  {
    "term": "File System",
    "explanations": [
      "A formatting of memory such as a disk by the Operating System to organize that memory into a hierarchy of directories and files. It can mean the format standard or the formatted memory."
    ]
  },
  {
    "term": "Floating Point Number",
    "explanations": ["A number with a decimal in it like 3.141592653589."]
  },
  {
    "term": "Front-side Bus",
    "explanations": [
      "It is a connection between the CPU and fast components of your computer like RAM and GPU(See the term Bus).",
      "Technically it is a term for a specific Intel transport mechanism but can be used in this general way"
    ]
  },
  {
    "term": "Functional Abstraction",
    "explanations": [
      "Abstraction to what a section of code will do rather than the details of how it does it.",
      "A function definition allows for abstracting the contained code to a simple call to a function."
    ]
  },
  {
    "term": "Giga",
    "explanations": [
      "A prefix for a billion, (10^9) as in a gigabyte or gigahertz or gigabananas (billion bananas)."
    ]
  },
  {
    "term": "Global variable",
    "explanations": [
      "A variable that is accessible from anywhere in the code. It is also persistent for the duration of the program."
    ]
  },
  {
    "term": "Graphics card",
    "explanations": [
      "Is a circuit board containing a CPU that processes instructions specifically targeted at graphics processing.",
      "This is especially useful for games and simulation programming."
    ]
  },
  {
    "term": "Graphics processing",
    "explanations": ["Image construction and manipulation."]
  },
  {
    "term": "HSB or HSV",
    "explanations": [
      "Stands for 'Hue, Saturation, Brightness or Value'.",
      "It is a way of specifying a color by giving the amount of each of three contributing factors to make the color:",
      "Hue is the color in the color wheel, Saturation is the amount of color versus white, Value is how bright the color is or distance from black."
    ]
  },
  {
    "term": "Hard drive",
    "explanations": ["Same as disk."]
  },
  {
    "term": "High Level Language",
    "explanations": [
      "A language that is NOT similar to the one that runs on the hardware and deals more complex data types and control structures than the hardware.",
      "Languages like Java, C, C++, Python..."
    ]
  },
  {
    "term": "I/O",
    "explanations": ["Input and output."]
  },
  {
    "term": "Kilo",
    "explanations": ["A prefix for a thousand, as in a kilobyte."]
  },
  {
    "term": "Local variable",
    "explanations": [
      "A variable that is accessible only in a portion of the code.",
      "Generally, within a procedure, and created as you enter a procedure and destroyed as you leave."
    ]
  },
  {
    "term": "Logic Error",
    "explanations": [
      "A semantic error.",
      "Note: Compiler writers may draw a subtle distinction between the two."
    ]
  },
  {
    "term": "Machine Instructions",
    "explanations": [
      "The instructions executed by a CPU.",
      "The bit level instructions of a computer."
    ]
  },
  {
    "term": "Machine Learning",
    "explanations": [
      "Is a branch of Artificial Intelligence that uses statistical modeling to learn from experience."
    ]
  },
  {
    "term": "Message Passing",
    "explanations": [
      "A way to pass information between processes, machines, or threads that are running in parallel."
    ]
  },
  {
    "term": "Multi-Core processor",
    "explanations": [
      "A chip with multiple processors and cache memory to speed execution."
    ]
  },
  {
    "term": "Object Oriented Programming",
    "explanations": [
      "A programming style in which variables and functions are associated in an object and visibility of the contents of the object is constrained.",
      "For example in Scratch, a sprite 'owns' its own local variables and scripts/threads."
    ]
  },
  {
    "term": "On-Chip",
    "explanations": [
      "Generally means the functionality is on the CPU chip or the chip under discussion.",
      "Can refer to hardware as in 'The north bridge can now be found on a chip' or refer to execution as in 'the data and instructions are cached on a chip'."
    ]
  },
  {
    "term": "Open Source",
    "explanations": [
      "An application or software that is provided with the source code, usually with few restrictions, for repurposing or augmenting."
    ]
  },
  {
    "term": "Operating System",
    "explanations": [
      "The program that runs on the computer hardware creating information objects such as files and processes and assures the fair and secure allocation of processor time, access to files, access to devices, and other resources.",
      "Accounts and access control of data is commonly provided giving privacy/security"
    ]
  },
  {
    "term": "Pairs Programming",
    "explanations": [
      "A programming methodology that has two programmers set down at a single keyboard and display to program as a team effort.",
      "Producing more and better working code."
    ]
  },
  {
    "term": "Parallel Computing",
    "explanations": [
      "The field of Computer Science that deals with algorithms, techniques, and hardware that enables simultaneous execution of many streams of instructions."
    ]
  },
  {
    "term": "Peta-",
    "explanations": ["A prefix for a quadrillion (10^15) as in a petabyte."]
  },
  {
    "term": "Powers of Two",
    "explanations": [
      "A number that is the product of two multiplied together many times.",
      "The kth power of two is denoted 2^k.",
      "Powers of two are very important in computing because k bits can be used to number 2^k things in binary.",
      "The first few powers of two are 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096."
    ]
  },
  {
    "term": "Scalable Computing",
    "explanations": [
      "An application supported on an amount of hardware that automatically adjusts to the size of the demand thereby saving money by using less hardware when demand is light and more when the demand is heavy."
    ]
  },
  {
    "term": "Semantic Error",
    "explanations": [
      "A legal program that creates incorrect results for some input."
    ]
  },
  {
    "term": "Solid state disk (SSD)",
    "explanations": [
      "Uses chips to emulate a rotating disk but with no moving parts.",
      "Much faster than rotating mechanical disks but currently not as much storage and more expensive."
    ]
  },
  {
    "term": "Strongly Typed",
    "explanations": [
      "A language is strongly typed if all type errors can be found at compile time."
    ]
  },
  {
    "term": "Syntax Error",
    "explanations": [
      "Creating an illegal program in the language by making an error such as a typo, insertion, deletion, or misuse of an element of the language.",
      "E.g. leaving off a trailing semicolon in Processing or misspelling a keyword."
    ]
  },
  {
    "term": "System Calls",
    "explanations": ["A programmatic interface to operating system features"]
  },
  {
    "term": "Tera-",
    "explanations": ["A prefix for a trillion (10^12) as in a terabyte."]
  },
  {
    "term": "Time sharing",
    "explanations": ["Fairly splitting up time between running processes."]
  },
  {
    "term": "Virtual Machine",
    "explanations": [
      "A virtual machine is a software implementation of a machine that executes programs like a physical machine.",
      "The machine that is mimicked need not have a hardware implementation but only exist as a virtual machine."
    ]
  }
]
